{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "import torch\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import json\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import requests \n",
    "import itertools\n",
    "import spotlight\n",
    "import tagme\n",
    "import inflect\n",
    "p = inflect.engine()\n",
    "import re\n",
    "import sys\n",
    "\n",
    "from nltk.stem.porter import *\n",
    "stemmer = PorterStemmer()\n",
    "\n",
    "tagme.GCUBE_TOKEN = \"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "with open('data/lc-quad/templates.json') as f:\n",
    "    templates = json.load(f)\n",
    "\n",
    "with open('data/lc-quad/test/id.txt') as f:\n",
    "    ids = f.read().strip().split('\\n')\n",
    "    \n",
    "with open('data/lc-quad/test/input.txt') as f:\n",
    "    questions = f.read().strip().split('\\n')\n",
    "    \n",
    "def preprocess_relations(file, prop=False):\n",
    "    relations = {}\n",
    "    with open(file) as f:\n",
    "        content = f.readlines()\n",
    "        for line in content:\n",
    "            split_line = line.split()\n",
    "\n",
    "            key = ' '.join(split_line[2:])[1:-3].lower()\n",
    "            key = ' '.join([stemmer.stem(word) for word in key.split()])\n",
    "            \n",
    "            if key not in relations:\n",
    "                relations[key] = []\n",
    "            \n",
    "            uri = split_line[0].replace('<', '').replace('>', '')\n",
    "            \n",
    "            if prop is True:                \n",
    "                uri_property = uri.replace('/ontology/', '/property/')\n",
    "                relations[key].extend([uri, uri_property])\n",
    "            else:\n",
    "                relations[key].append(uri)                \n",
    "    return relations    \n",
    "\n",
    "properties = preprocess_relations('dbpedia_3Eng_property.ttl', True)\n",
    "classes = preprocess_relations('dbpedia_3Eng_class.ttl')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "# Prediction k-templates\n",
    "#saved_model = torch.load('checkpoints/Even more grammar changes,epoch=6,test_acc=0.8246887966804979.pt')\n",
    "saved_model = torch.load('checkpoints/rnn-question-answering,epoch=7,test_acc=0.8143153526970954.pt')\n",
    "trainer = saved_model['trainer']\n",
    "test_dataset = torch.load('data/lc-quad/pth/lc_quad_test.pth')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/joraojr./Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/torch/nn/functional.py:1709: UserWarning: nn.functional.sigmoid is deprecated. Use torch.sigmoid instead.\n",
      "  warnings.warn(\"nn.functional.sigmoid is deprecated. Use torch.sigmoid instead.\")\n",
      "/Users/joraojr./Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/torch/nn/functional.py:1698: UserWarning: nn.functional.tanh is deprecated. Use torch.tanh instead.\n",
      "  warnings.warn(\"nn.functional.tanh is deprecated. Use torch.tanh instead.\")\n"
     ]
    }
   ],
   "source": [
    "y_true = []\n",
    "y_pred = []\n",
    "output_vocab = trainer.vocabs['output']\n",
    "\n",
    "for index in range(len(test_dataset)):\n",
    "    torch.no_grad()    \n",
    "    _, toks_sent, _, _, _ = test_dataset[index]\n",
    "    tree, emb, target = trainer.get_data(test_dataset[index], test_dataset.num_classes)\n",
    "    output = trainer.model.forward(tree, emb, training=False)\n",
    "    _, pred = torch.topk(output[0].squeeze(0), 2)\n",
    "    \n",
    "    pred = pred.numpy()\n",
    "    target = target.numpy()\n",
    "    \n",
    "    pred_0 = output_vocab.idxToLabel[pred[0]]\n",
    "    pred_1 = output_vocab.idxToLabel[pred[1]]\n",
    "    target = output_vocab.idxToLabel[target[0]]    \n",
    "    \n",
    "    y_true.append(target)\n",
    "    y_pred.append([pred_0, pred_1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "# Sorts based on descending order of values\n",
    "def sort_dict_by_values(dictionary):\n",
    "    keys = []\n",
    "    for key, value in sorted(dictionary.items(), key=lambda item: (item[1], item[0]), reverse=True):\n",
    "        keys.append(key)\n",
    "    return keys\n",
    "\n",
    "def get_earl_entities(query):\n",
    "    THRESHOLD = 0.0001\n",
    "    MAX_RESOURCES = 3\n",
    "    MAX_PREDICATES = 5\n",
    "    MAX_CLASSES = 3\n",
    "    \n",
    "    response = requests.post('http://sda.tech/earl/api/processQuery', \n",
    "                             json={\"nlquery\": query, \"pagerankflag\": False})\n",
    "    \n",
    "    json_response = json.loads(response.text)\n",
    "    r_dict = {}\n",
    "    c_dict = {}\n",
    "    p_dict = {}\n",
    "    \n",
    "    reranked_lists = json_response['rerankedlists']\n",
    "    for key in reranked_lists.keys():\n",
    "        for result in reranked_lists[key]:\n",
    "            if result[0] < THRESHOLD:\n",
    "                continue                \n",
    "            \n",
    "            if result[1].startswith('http://dbpedia.org/resource/'):\n",
    "                r_dict[result[1]] = result[0]\n",
    "            elif result[1].startswith('http://dbpedia.org/'): \n",
    "                # Add to Classes\n",
    "                if result[1].split('/')[-1][0].isupper(): \n",
    "                    c_dict[result[1]] = result[0]\n",
    "                # Add to Predicates\n",
    "                else:\n",
    "                    p_dict[result[1]] = result[0]\n",
    "        \n",
    "    return {\n",
    "        'r': sort_dict_by_values(r_dict)[:MAX_RESOURCES], \n",
    "        'p': sort_dict_by_values(p_dict)[:MAX_PREDICATES], \n",
    "        'c': sort_dict_by_values(c_dict)[:MAX_CLASSES]\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def get_tag_me_entities(query):\n",
    "    MAX_ENTITIES = 5\n",
    "    results = []\n",
    "    response = requests.get(\"https://tagme.d4science.org/tagme/tag?lang=en&gcube-token={}&text={}\"\n",
    "                           .format('1b4eb12e-d434-4b30-8c7f-91b3395b96e8-843339462', query))\n",
    "    \n",
    "    annotations = {}\n",
    "    for annotation in json.loads(response.text)['annotations']:        \n",
    "        annotations['http://dbpedia.org/resource/' + annotation['title'].replace(' ', '_')] = annotation['rho']\n",
    "    return sort_dict_by_values(annotations)[:MAX_ENTITIES]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def get_nliwod_entities(query, hashmap, include_properties = False):\n",
    "#     ignore_list = ['name', 'list']\n",
    "    ignore_list = []\n",
    "    entities = []\n",
    "    singular_query = [stemmer.stem(word) if p.singular_noun(word) == False else stemmer.stem(p.singular_noun(word)) for word in query.lower().split(' ')]\n",
    "    \n",
    "    for key in hashmap.keys():\n",
    "        if key in ' '.join(singular_query) and len(key) > 2 and key not in ignore_list:\n",
    "            entities += hashmap[key]\n",
    "    return list(set(entities))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def get_entities(query):    \n",
    "    return {\n",
    "        'r': get_tag_me_entities(query),\n",
    "        'p': get_nliwod_entities(query, properties, True),\n",
    "        'c': get_nliwod_entities(query, classes)\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def get_spotlight_entities(query):\n",
    "    entities = []\n",
    "    try:\n",
    "        annotations = spotlight.annotate('http://model.dbpedia-spotlight.org/en/annotate', query, confidence=0.4)\n",
    "        for annotation in annotations:\n",
    "            entities.append(annotation['URI'])\n",
    "    except:\n",
    "        pass\n",
    "    return entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def make_sparql_query(query, return_var):\n",
    "    sparql = SPARQLWrapper(\"http://akswnc9.aksw.uni-leipzig.de/dbpedia/sparql\")\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    \n",
    "    if return_var == 'boolean':\n",
    "        if 'boolean' in results:            \n",
    "            return results['boolean']\n",
    "        else:\n",
    "            return None\n",
    "    \n",
    "    output = []\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        if return_var in result:\n",
    "            output.append(result[return_var]['value'])\n",
    "    return output\n",
    "\n",
    "\n",
    "def get_rdfs_label(prop):\n",
    "    sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "    SELECT ?label WHERE { <\"\"\" + prop + \"\"\"> rdfs:label ?label . FILTER(lang(?label) = 'en') }\n",
    "    \"\"\")\n",
    "    sparql.setReturnFormat(JSON)    \n",
    "    results = sparql.query().convert()\n",
    "    \n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        return result['label']['value']\n",
    "    return None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "ename": "FileNotFoundError",
     "evalue": "[Errno 2] No such file or directory: 'data/lc-quad/dataset.csv'",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mFileNotFoundError\u001B[0m                         Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-33-1e84448310b8>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m\u001B[0m\n\u001B[0;32m----> 1\u001B[0;31m \u001B[0mdf\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mpd\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mread_csv\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m'data/lc-quad/dataset.csv'\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m      2\u001B[0m \u001B[0;32mdef\u001B[0m \u001B[0mget_entities_from_answer\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      3\u001B[0m \u001B[0;31m#     string = df[df['_id'] == int(id)]['sparql_query'].tolist()[0]\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      4\u001B[0m     \u001B[0mstring\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mqald\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'sparql_query'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      5\u001B[0m     \u001B[0mmatches\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mre\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mfindall\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m'<[^>]*>'\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mstring\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36mread_csv\u001B[0;34m(filepath_or_buffer, sep, delimiter, header, names, index_col, usecols, squeeze, prefix, mangle_dupe_cols, dtype, engine, converters, true_values, false_values, skipinitialspace, skiprows, skipfooter, nrows, na_values, keep_default_na, na_filter, verbose, skip_blank_lines, parse_dates, infer_datetime_format, keep_date_col, date_parser, dayfirst, cache_dates, iterator, chunksize, compression, thousands, decimal, lineterminator, quotechar, quoting, doublequote, escapechar, comment, encoding, dialect, error_bad_lines, warn_bad_lines, delim_whitespace, low_memory, memory_map, float_precision, storage_options)\u001B[0m\n\u001B[1;32m    608\u001B[0m     \u001B[0mkwds\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mupdate\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mkwds_defaults\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    609\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 610\u001B[0;31m     \u001B[0;32mreturn\u001B[0m \u001B[0m_read\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mfilepath_or_buffer\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mkwds\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    611\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    612\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36m_read\u001B[0;34m(filepath_or_buffer, kwds)\u001B[0m\n\u001B[1;32m    460\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    461\u001B[0m     \u001B[0;31m# Create the parser.\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 462\u001B[0;31m     \u001B[0mparser\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mTextFileReader\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mfilepath_or_buffer\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwds\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    463\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    464\u001B[0m     \u001B[0;32mif\u001B[0m \u001B[0mchunksize\u001B[0m \u001B[0;32mor\u001B[0m \u001B[0miterator\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36m__init__\u001B[0;34m(self, f, engine, **kwds)\u001B[0m\n\u001B[1;32m    817\u001B[0m             \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0moptions\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"has_index_names\"\u001B[0m\u001B[0;34m]\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mkwds\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"has_index_names\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    818\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 819\u001B[0;31m         \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_engine\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_make_engine\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mengine\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    820\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    821\u001B[0m     \u001B[0;32mdef\u001B[0m \u001B[0mclose\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36m_make_engine\u001B[0;34m(self, engine)\u001B[0m\n\u001B[1;32m   1048\u001B[0m             )\n\u001B[1;32m   1049\u001B[0m         \u001B[0;31m# error: Too many arguments for \"ParserBase\"\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m-> 1050\u001B[0;31m         \u001B[0;32mreturn\u001B[0m \u001B[0mmapping\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mengine\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mf\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0moptions\u001B[0m\u001B[0;34m)\u001B[0m  \u001B[0;31m# type: ignore[call-arg]\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1051\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1052\u001B[0m     \u001B[0;32mdef\u001B[0m \u001B[0m_failover_to_python\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36m__init__\u001B[0;34m(self, src, **kwds)\u001B[0m\n\u001B[1;32m   1865\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1866\u001B[0m         \u001B[0;31m# open handles\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m-> 1867\u001B[0;31m         \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_open_handles\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0msrc\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mkwds\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1868\u001B[0m         \u001B[0;32massert\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mhandles\u001B[0m \u001B[0;32mis\u001B[0m \u001B[0;32mnot\u001B[0m \u001B[0;32mNone\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1869\u001B[0m         \u001B[0;32mfor\u001B[0m \u001B[0mkey\u001B[0m \u001B[0;32min\u001B[0m \u001B[0;34m(\u001B[0m\u001B[0;34m\"storage_options\"\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m\"encoding\"\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m\"memory_map\"\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m\"compression\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/parsers.py\u001B[0m in \u001B[0;36m_open_handles\u001B[0;34m(self, src, kwds)\u001B[0m\n\u001B[1;32m   1360\u001B[0m         \u001B[0mLet\u001B[0m \u001B[0mthe\u001B[0m \u001B[0mreaders\u001B[0m \u001B[0mopen\u001B[0m \u001B[0mIOHanldes\u001B[0m \u001B[0mafter\u001B[0m \u001B[0mthey\u001B[0m \u001B[0mare\u001B[0m \u001B[0mdone\u001B[0m \u001B[0;32mwith\u001B[0m \u001B[0mtheir\u001B[0m \u001B[0mpotential\u001B[0m \u001B[0mraises\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1361\u001B[0m         \"\"\"\n\u001B[0;32m-> 1362\u001B[0;31m         self.handles = get_handle(\n\u001B[0m\u001B[1;32m   1363\u001B[0m             \u001B[0msrc\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1364\u001B[0m             \u001B[0;34m\"r\"\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/Documents/Mestrado/ckbqa-templates/ckbqa-templates/venv/lib/python3.9/site-packages/pandas/io/common.py\u001B[0m in \u001B[0;36mget_handle\u001B[0;34m(path_or_buf, mode, encoding, compression, memory_map, is_text, errors, storage_options)\u001B[0m\n\u001B[1;32m    640\u001B[0m                 \u001B[0merrors\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0;34m\"replace\"\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    641\u001B[0m             \u001B[0;31m# Encoding\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 642\u001B[0;31m             handle = open(\n\u001B[0m\u001B[1;32m    643\u001B[0m                 \u001B[0mhandle\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    644\u001B[0m                 \u001B[0mioargs\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mmode\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mFileNotFoundError\u001B[0m: [Errno 2] No such file or directory: 'data/lc-quad/dataset.csv'"
     ]
    }
   ],
   "source": [
    "df = pd.read_csv('data/lc-quad/dataset.csv')\n",
    "def get_entities_from_answer(index):\n",
    "#     string = df[df['_id'] == int(id)]['sparql_query'].tolist()[0]        \n",
    "    string = qald[index]['sparql_query'] \n",
    "    matches = re.findall('<[^>]*>', string)\n",
    "    matches = [uri.replace('<', '').replace('>', '') for uri in matches if uri != '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>']\n",
    "    \n",
    "    results = {'r': set(), 'p': set(), 'c': set()}    \n",
    "    for match in matches:\n",
    "        if match.startswith('http://dbpedia.org/resource/'):\n",
    "            results['r'].add(match)\n",
    "        elif match.split('/')[-1][0].isupper():\n",
    "            results['c'].add(match)\n",
    "        else:\n",
    "            results['p'].add(match)\n",
    "    \n",
    "    return results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "# # QALD Slot Filling\n",
    "# hashmap = {}\n",
    "# with open('data/qald/qald-7-train-multilingual.json', 'r') as f:\n",
    "#     qald_train = json.load(f)\n",
    "\n",
    "# with open('data/qald/qald.json', 'r') as f:\n",
    "#     qald = json.load(f)\n",
    "\n",
    "# for question in qald_train['questions']:\n",
    "#     hashmap[question['question'][0]['string']] = question['query']['sparql']\n",
    "\n",
    "# for index in range(len(qald)):\n",
    "#     qald[index]['sparql_query'] = hashmap[qald[index]['question']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def detect_entities(question, index):\n",
    "    entities_list = get_entities_from_answer(index)\n",
    "    detected_entities = get_earl_entities(question)\n",
    "    detected_entities['r'] = get_tag_me_entities(question) + get_spotlight_entities(question)\n",
    "\n",
    "    for e_index in range(len(detected_entities['p'])): # Adding property namespace to Earl predicates\n",
    "        entity = detected_entities['p'][e_index]\n",
    "        detected_entities['p'].append(entity.replace('/ontology/', '/property/'))\n",
    "\n",
    "    detected_entities['p'] += get_nliwod_entities(question, properties)\n",
    "\n",
    "    for e_index in range(len(detected_entities['p'])): # Adding plural properties to all detected predicates\n",
    "        entity = detected_entities['p'][e_index]\n",
    "        if entity.startswith('http://dbpedia.org/property/'):\n",
    "            pred = entity.split('/')[-1].split('_')\n",
    "            if len(pred) == 1:\n",
    "                detected_entities['p'].append('http://dbpedia.org/property/' + p.plural_noun(pred[0]))\n",
    "\n",
    "    detected_entities['r'] = set(detected_entities['r'])\n",
    "    detected_entities['p'] = set(detected_entities['p'])\n",
    "\n",
    "    unique_p = set()\n",
    "    for entity in detected_entities['p']:\n",
    "        e = p.singular_noun(entity.split('/')[-1])\n",
    "        if e is not False:\n",
    "            unique_p.add(e)\n",
    "\n",
    "    for entity in unique_p:\n",
    "        if entity == entity.lower():\n",
    "            detected_entities['c'].append('http://dbpedia.org/ontology/' + entity[0].upper() + entity[1:])        \n",
    "    detected_entities['c'] = set(detected_entities['c'])\n",
    "    return detected_entities, entities_list, unique_p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "0 Philadelphia City Council is the governing body of which city?\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'get_entities_from_answer' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mNameError\u001B[0m                                 Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-36-1190d216988c>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m\u001B[0m\n\u001B[1;32m     17\u001B[0m     \u001B[0mprint\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     18\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 19\u001B[0;31m     \u001B[0mdetected_entities\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mentities_list\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0munique_p\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mdetect_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     20\u001B[0m     row = [len(entities_list['r']), len(entities_list['p']), len(entities_list['c']),\n\u001B[1;32m     21\u001B[0m            \u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0munique_p\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'c'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m<ipython-input-34-3d3efc9ed431>\u001B[0m in \u001B[0;36mdetect_entities\u001B[0;34m(question, index)\u001B[0m\n\u001B[1;32m      1\u001B[0m \u001B[0;32mdef\u001B[0m \u001B[0mdetect_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m----> 2\u001B[0;31m     \u001B[0mentities_list\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_entities_from_answer\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m      3\u001B[0m     \u001B[0mdetected_entities\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_earl_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      4\u001B[0m     \u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_tag_me_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;34m+\u001B[0m \u001B[0mget_spotlight_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      5\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mNameError\u001B[0m: name 'get_entities_from_answer' is not defined"
     ]
    }
   ],
   "source": [
    "start = 0\n",
    "exists = 0\n",
    "count = 1\n",
    "results = []\n",
    "\n",
    "# res_df = pd.read_csv('slot_results.csv')\n",
    "\n",
    "for index in range(start, len(questions)):\n",
    "#     df_row = res_df.loc[index,:]\n",
    "#     if df_row['Correct'] == True:\n",
    "#         continue\n",
    "        \n",
    "#     if df_row['C_R'] != df_row['N_R'] and df_row['C_P'] == df_row['N_P']:\n",
    "    question = questions[index]\n",
    "\n",
    "    print('\\n' * 2)    \n",
    "    print(index, question)\n",
    "    \n",
    "    detected_entities, entities_list, unique_p = detect_entities(question, index)\n",
    "    row = [len(entities_list['r']), len(entities_list['p']), len(entities_list['c']),\n",
    "           len(detected_entities['r']), len(unique_p), len(detected_entities['c']),\n",
    "\n",
    "           len(entities_list['r'].intersection(detected_entities['r'])),\n",
    "           len(entities_list['p'].intersection(detected_entities['p'])),\n",
    "           len(entities_list['c'].intersection(detected_entities['c']))\n",
    "          ]\n",
    "    row.append(row[0] == row[-3] and row[1] == row[-2] and row[2] == row[-1]) # Check if number and correct are the same    \n",
    "\n",
    "#     results.append(row)\n",
    "#     res_df.loc[index,:] = row\n",
    "    print('\\n', entities_list['r'] - detected_entities['r'], '\\n', entities_list['p'] - detected_entities['p'])    \n",
    "    print(index, row)            \n",
    "    break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "# res_df = pd.DataFrame(results, columns=['N_R', 'N_P', 'N_C', 'D_R', 'D_P', 'D_C', 'C_R', 'C_P', 'C_C', 'Correct'])\n",
    "# res_df.to_csv('slot_results.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open('props.csv') as f:\n",
    "#     props = f.read().split('\\n')\n",
    "# props = props[1:]\n",
    "\n",
    "# string = ''\n",
    "# for prop in props:\n",
    "#     label = get_rdfs_label(prop)\n",
    "#     if label is not None:\n",
    "#         print(prop, label)\n",
    "#         string += '<' + prop + '>' + '<http://www.w3.org/2000/01/rdf-schema#label> \"' + label + '\" .\\n'\n",
    "        \n",
    "# with open('props.txt', 'w') as f:\n",
    "#     f.write(string)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'res_df' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mNameError\u001B[0m                                 Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-22-6df04feb46ce>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m\u001B[0m\n\u001B[0;32m----> 1\u001B[0;31m \u001B[0mcorrect\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mres_df\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'Correct'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m      2\u001B[0m \u001B[0maccuracy\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0;36m0\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      3\u001B[0m \u001B[0mtop_2_accuracy\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0;36m0\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      4\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      5\u001B[0m \u001B[0;32mfor\u001B[0m \u001B[0mindex\u001B[0m \u001B[0;32min\u001B[0m \u001B[0mrange\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestions\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mNameError\u001B[0m: name 'res_df' is not defined"
     ]
    }
   ],
   "source": [
    "correct = res_df['Correct']\n",
    "accuracy = 0\n",
    "top_2_accuracy = 0\n",
    "\n",
    "for index in range(len(questions)):\n",
    "    if correct[index] == True:\n",
    "        if y_true[index] == y_pred[index][0]:\n",
    "            accuracy += 1\n",
    "            top_2_accuracy += 1\n",
    "        elif y_true[index] == y_pred[index][1]:\n",
    "            top_2_accuracy += 1\n",
    "accuracy / len(correct), top_2_accuracy / len(correct), correct.sum() / len(correct)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.8132780082987552, 0.6182572614107884, 0.837465564738292)"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(res_df[res_df['N_R'] == res_df['C_R']]) / len(questions), len(res_df[res_df['N_P'] == res_df['C_P']]) / len(questions), len(res_df[(res_df['N_C'] == res_df['C_C']) & res_df['N_C'] > 0]) / len(res_df[res_df['N_C'] > 0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def get_answer(entities, template_id):\n",
    "    output = []\n",
    "    sparql_query = ''\n",
    "    \n",
    "    template = templates[str(template_id)]\n",
    "    slots = {}\n",
    "    for slot in template['slots']:\n",
    "        slots[slot] = entities[slot[0]]        \n",
    "    \n",
    "    # This means something probably went wrong and no predicates or resources were detected for the query\n",
    "    if len(slots['p']) == 0 or len(slots['r']) == 0:\n",
    "        return output, sparql_query\n",
    "    \n",
    "    ranges = []\n",
    "    slot_keys = list(slots.keys())\n",
    "    slot_len = len(slot_keys)\n",
    "    for slot in slot_keys:\n",
    "        ranges.append(range(len(slots[slot]))) \n",
    "    \n",
    "    for i in itertools.product(*ranges):\n",
    "        if slot_keys[0] == 'p' and slot_keys[1] == 'p2' and slots['p'][i[0]] == slots['p2'][i[1]]:\n",
    "            continue\n",
    "        if slot_keys[-2] == 'r' and slot_keys[-1] == 'r2' and slots['r'][i[-2]] == slots['r2'][i[-1]]:\n",
    "            continue\n",
    "            \n",
    "        sparql_query = template['sparql']                \n",
    "        for index in range(slot_len):\n",
    "            sparql_query = sparql_query.replace('<' + slot_keys[index] + '>', '<' + slots[slot_keys[index]][i[index]] + '>')\n",
    "        \n",
    "        print('.', end='')\n",
    "        \n",
    "        output = make_sparql_query(sparql_query, template['return'])        \n",
    "        if template['return'] == 'boolean':\n",
    "            if output == None:\n",
    "                output = []\n",
    "            else:\n",
    "                output = [output]\n",
    "\n",
    "        if template['return'] == 'count' and int(output[0]) == 0:\n",
    "            continue\n",
    "            \n",
    "        elif len(output) > 0:\n",
    "            break\n",
    "\n",
    "    return output, sparql_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "def filter_out_entities(resources, predicates):\n",
    "    sparql = SPARQLWrapper(\"http://akswnc9.aksw.uni-leipzig.de/dbpedia/sparql\")\n",
    "    result = []\n",
    "    \n",
    "    if len(resources) == 0:\n",
    "        return []\n",
    "    \n",
    "    query = \"\"\"\n",
    "    SELECT DISTINCT ?p WHERE {\n",
    "        VALUES ?r {\n",
    "            \"\"\" + '<' + '> <'.join(resources) + '>' + \"\"\"\n",
    "        }\n",
    "\n",
    "        { ?r ?p ?x }\n",
    "        UNION {?r ?p2 ?x . ?x ?p ?x2}\n",
    "        UNION {?x ?p ?r}\n",
    "        UNION {?x ?p2 ?r . ?x ?p ?x2}\n",
    "    }\n",
    "    \"\"\"\n",
    "    \n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)    \n",
    "    result_set = sparql.query().convert()\n",
    "    preds = set()    \n",
    "    \n",
    "    for result in result_set['results']['bindings']:\n",
    "        preds.add(result['p']['value'])\n",
    "    \n",
    "    return list(predicates.intersection(preds))\n",
    "\n",
    "def filter_out_classes(classes):\n",
    "    results = []\n",
    "    for _class in list(classes):\n",
    "        if get_rdfs_label(_class) != None:\n",
    "            results.append(_class)\n",
    "    return results    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 172,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'actual': '2',\n",
       " 'predictions': '2,1',\n",
       " 'question': 'Who is the mayor of Tel Aviv?',\n",
       " 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tel_Aviv> <http://dbpedia.org/ontology/leaderName> ?uri .}'}"
      ]
     },
     "execution_count": 172,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with open('data/qald/qald.json', 'r') as f:\n",
    "    qald = json.load(f)\n",
    "\n",
    "qald[45]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "\n",
      "0 {'question': 'List all the musicals with music by Elton John.', 'predictions': '1,8', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n        ?uri <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John> .\\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> .\\n\\n}'} 1\n",
      "..\n",
      "\n",
      "\n",
      "\n",
      "1 {'question': 'How high is the lighthouse in Colombo?', 'predictions': '101,151', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Colombo_Lighthouse> <http://dbpedia.org/ontology/height> ?num . } '} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "2 {'question': 'Who was the wife of U.S. president Lincoln?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/Abraham_Lincoln? <http://dbpedia.org/ontology/spouse> ?uri.\\n}'} 8\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "3 {'question': 'Who is the host of the BBC Wildlife Specials?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BBC_Wildlife_Specials> <http://dbpedia.org/ontology/presenter> ?uri . }'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "4 {'question': 'How much did Pulp Fiction cost?', 'predictions': '101,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Pulp_Fiction> <http://dbpedia.org/ontology/budget> ?n . } '} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "5 {'question': 'In what city is the Heineken brewery?', 'predictions': '2,3', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heineken> <http://dbpedia.org/ontology/manufacturer> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri . }'} 101\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "6 {'question': 'In which city does the Chile Route 68 end?', 'predictions': '2,3', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chile_Route_68> <http://dbpedia.org/ontology/routeEnd> ?uri . } '} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "7 {'question': 'Who developed Slack?', 'predictions': '2,1', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Slack_(software)> . }'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "8 {'question': 'Who was married to president Chirac?', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n         <http://dbpedia.org/resource/Jacques_Chirac> <http://dbpedia.org/ontology/spouse> ?uri .\\n}'} 5\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "9 {'question': 'What did Bruce Carver die from?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        <http://dbpedia.org/resource/Bruce_Carver> <http://dbpedia.org/ontology/deathCause> ?uri .     \\n}'} 101\n",
      "...\n",
      "\n",
      "\n",
      "\n",
      "10 {'question': 'Which cities does the Weser flow through?', 'predictions': '2,3', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Weser> <http://dbpedia.org/ontology/city> ?uri . } '} 111\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "11 {'question': 'How many seats does the home stadium of FC Porto have?', 'predictions': '105,101', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/FC_Porto> <http://dbpedia.org/ontology/ground> ?x . ?x <http://dbpedia.org/ontology/seatingCapacity> ?n . } '} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "12 {'question': 'Who is the daughter of Robert Kennedy married to?', 'predictions': '1,2', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Robert_F._Kennedy> <http://dbpedia.org/ontology/child> ?child .  ?child <http://dbpedia.org/ontology/spouse> ?uri . } '} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "13 {'question': 'Which books by Kerouac were published by Viking Press?', 'predictions': '1,8', 'actual': '8', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Viking_Press> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jack_Kerouac> . } '} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "14 {'question': 'How tall is Amazon Eve?', 'predictions': '151,101', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?height WHERE {  <http://dbpedia.org/resource/Amazon_Eve> <http://dbpedia.org/ontology/height> ?height . } '} 101\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "15 {'question': 'Which museum exhibits The Scream by Munch?', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n       <http://dbpedia.org/resource/The_Scream> <http://dbpedia.org/ontology/museum> ?uri .\\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "16 {'question': 'Who wrote the book Les Piliers de la terre?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/The_Pillars_of_the_Earth> <http://dbpedia.org/ontology/author> ?uri .\\n}'} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "17 {'question': 'Who discovered Ceres?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ceres_(dwarf_planet)> <http://dbpedia.org/ontology/discoverer> ?uri . }'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "18 {'question': 'Which river does the Brooklyn Bridge cross?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {       \\n        <http://dbpedia.org/resource/Brooklyn_Bridge> <http://dbpedia.org/ontology/crosses> ?uri . \\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "19 {'question': 'Who is the mayor of Paris?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?uri . }'} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "20 {'question': 'Who is the mayor of the capital of French Polynesia?', 'predictions': '3,5', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        <http://dbpedia.org/resource/French_Polynesia> <http://dbpedia.org/ontology/capital> ?x .\\n        ?x <http://dbpedia.org/ontology/mayor> ?uri .\\n}'} 3\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "21 {'question': 'Which awards did Douglas Hofstadter win?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        <http://dbpedia.org/resource/Douglas_Hofstadter> <http://dbpedia.org/ontology/award> ?uri .\\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "22 {'question': 'How much did the Lego Movie cost?', 'predictions': '2,101', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/The_Lego_Movie> <http://dbpedia.org/ontology/budget> ?n . } '} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "23 {'question': 'Where does Piccadilly start?', 'predictions': '2,1', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Piccadilly>. } '} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "24 {'question': 'In which films did Julia Roberts as well as Richard Gere play?', 'predictions': '15,16', 'actual': '7', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Gere> . } '} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "25 {'question': 'In which country does the Ganges start?', 'predictions': '3,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        <http://dbpedia.org/resource/Ganges> <http://dbpedia.org/ontology/sourceCountry> ?uri .\\n}'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "26 {'question': 'Is Barack Obama a democrat?', 'predictions': '151,1', 'actual': '151', 'sparql_query': 'ASK\\nWHERE { \\n        <http://dbpedia.org/resource/Barack_Obama> <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Democratic_Party_(United_States)> . \\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "27 {'question': 'Where was Bach born?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        <http://dbpedia.org/resource/Johann_Sebastian_Bach> <http://dbpedia.org/ontology/birthPlace> ?uri .\\n}'} 5\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "28 {'question': 'Who was the first to climb Mount Everest?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n          <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/firstAscentPerson> ?uri . \\n}'} 1\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "29 {'question': 'How many people live in Poland?', 'predictions': '101,105', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Poland> <http://dbpedia.org/ontology/populationTotal> ?uri . }  '} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "30 {'question': 'What is the location of the Houses of Parliament?', 'predictions': '2,5', 'actual': '2', 'sparql_query': 'SELECT ?uri WHERE {  <http://dbpedia.org/resource/Palace_of_Westminster> <http://dbpedia.org/ontology/location> ?uri . } '} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "31 {'question': 'Is Christian Bale starring in Batman Begins?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK WHERE {\\n\\t<http://dbpedia.org/resource/Batman_Begins> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Christian_Bale> .\\n}'} 111\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "32 {'question': 'In which country is the Limerick Lake?', 'predictions': '5,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n\\t<http://dbpedia.org/resource/Limerick_Lake> <http://dbpedia.org/ontology/country> ?uri .\\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "33 {'question': 'Who created Family Guy?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Family_Guy> <http://dbpedia.org/ontology/creator> ?uri . }  '} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "34 {'question': 'What is the official language of Suriname?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n        <http://dbpedia.org/resource/Suriname> <http://dbpedia.org/ontology/officialLanguage> ?uri .\\n}'} 111\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "35 {'question': 'Who wrote the song Hotel California?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hotel_California> <http://dbpedia.org/ontology/writer> ?uri . }'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "36 {'question': 'Give me all actors starring in movies directed by William Shatner.', 'predictions': '6,1', 'actual': '5', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } '} 101\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "37 {'question': 'What is in a chocolate chip cookie?', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chocolate_chip_cookie> <http://dbpedia.org/ontology/ingredient> ?uri . }'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "38 {'question': 'Which ingredients do I need for carrot cake?', 'predictions': '2,5', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Carrot_cake> <http://dbpedia.org/ontology/ingredient> ?uri . } '} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "39 {'question': 'Does Neymar play for Real Madrid?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK WHERE { <http://dbpedia.org/resource/Neymar> <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Real_Madrid_C.F.> . }'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "40 {'question': 'What does IYCM stand for?', 'predictions': '2,1', 'actual': '1', 'sparql_query': \"SELECT DISTINCT ?uri\\nWHERE {\\n        ?uri <http://dbpedia.org/ontology/abbreviation> 'IYCM' .\\n}\"} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "41 {'question': 'What is the total population of Melbourne, Florida?', 'predictions': '101,2', 'actual': '2', 'sparql_query': 'SELECT ?uri \\nWHERE { \\n        <http://dbpedia.org/resource/Melbourne,_Florida> <http://dbpedia.org/ontology/populationTotal> ?uri .\\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "42 {'question': 'What country is Mount Everest in?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n        <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/locatedInArea ?uri . \\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .\\n}'} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "43 {'question': 'What is the largest city in Australia?', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/largestCity> ?uri .\\n}'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "44 {'question': 'Give me all launch pads operated by NASA.', 'predictions': '1,6', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .  \\n        ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> . \\n}'} 11\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "45 {'question': 'Who is the mayor of Tel Aviv?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .  \\n        ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> . \\n}'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "46 {'question': 'List all episodes of the first season of the HBO television series The Sopranos.', 'predictions': '1,6', 'actual': '8', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Sopranos> .\\n        ?uri <http://dbpedia.org/ontology/seasonNumber> 1 .\\n}'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "47 {'question': 'Who created Batman?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } '} 1\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "48 {'question': 'Who played Gus Fring in Breaking Bad?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gus_Fring> <http://dbpedia.org/ontology/portrayer> ?uri . }'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "49 {'question': 'In which programming language is GIMP written?', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n\\t<http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> ?uri .\\n}'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "50 {'question': 'In which ancient empire could you pay with cocoa beans?', 'predictions': '2,1', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Cocoa_bean> . }'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "51 {'question': 'Who is the editor of Forbes?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        <http://dbpedia.org/resource/Forbes> <http://dbpedia.org/ontology/editor> ?uri .\\n}'} 111\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "52 {'question': 'How many people live in the capital of Australia?', 'predictions': '101,105', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?num \\nWHERE {\\n        <http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/capital> ?x .\\n        ?x <http://dbpedia.org/ontology/populationTotal> ?num .\\n}'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "53 {'question': 'Which professional surfers were born in Australia?', 'predictions': '1,5', 'actual': '8', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Surfing> .\\n        ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Australia> .\\n}'} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "54 {'question': 'Give me all video games published by Mean Hamster Software.', 'predictions': '1,6', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n      ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame> .\\n      ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software> . \\n}'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "55 {'question': 'How many Aldi stores are there?', 'predictions': '101,105', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/Aldi> <http://dbpedia.org/ontology/numberOfLocations> ?number . } '} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "56 {'question': 'What is the capital of Cameroon?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cameroon> <http://dbpedia.org/ontology/capital> ?uri. } '} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "57 {'question': 'Give me all movies directed by Francis Ford Coppola.', 'predictions': '1,6', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . } '} 6\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "58 {'question': 'Give me the grandchildren of Elvis Presley.', 'predictions': '1,5', 'actual': '11', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "59 {'question': 'Which movies starring Mickey Rourke were directed by Guy Ritchie?', 'predictions': '1,8', 'actual': '8', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mickey_Rourke> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> . } '} 8\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "60 {'question': \"When did Dracula's creator die?\", 'predictions': '2,1', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Count_Dracula> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/deathDate> ?date . } '} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "61 {'question': 'Which country does the creator of Miffy come from?', 'predictions': '3,5', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/Miffy> <http://dbpedia.org/ontology/creator> ?x .\\n\\t?x <http://dbpedia.org/ontology/nationality> ?uri .\\n}'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "62 {'question': \"What is Batman's real name?\", 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?s WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/alterEgo> ?s . }'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "63 {'question': 'What form of government does Russia have?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/governmentType> ?uri . } '} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "64 {'question': 'Give me all Canadian Grunge record labels.', 'predictions': '1,5', 'actual': '8', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RecordLabel> .\\n        ?uri <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Grunge> .\\n        ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Canada> .\\n}'} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "65 {'question': 'List the children of Margaret Thatcher.', 'predictions': '2,5', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?uri .\\n}'} 8\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "66 {'question': 'From which region is the Melon de Bourgogne?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        <http://dbpedia.org/resource/Melon_de_Bourgogne> <http://dbpedia.org/ontology/wineRegion> ?uri .\\n}'} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "67 {'question': 'Are tree frogs a type of amphibian?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE { \\n        <http://dbpedia.org/resource/Hylidae> <http://dbpedia.org/ontology/class> <http://dbpedia.org/resource/Amphibian . \\n}'} 6\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "68 {'question': 'Is Christian Bale starring in Velvet Goldmine?', 'predictions': '151,8', 'actual': '151', 'sparql_query': 'ASK\\nWHERE {\\n        <http://dbpedia.org/resource/Velvet_Goldmine> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Christian_Bale .\\n}'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "69 {'question': 'List all games by GMT.', 'predictions': '1,5', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\t\\n        ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> .\\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "70 {'question': 'Which airports does Yeti Airlines serve?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Yeti_Airlines> <http://dbpedia.org/ontology/targetAirport> ?uri . }'} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "71 {'question': 'What color expresses loyalty?', 'predictions': '1,2', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/connotation> <http://dbpedia.org/resource/Loyalty> . }'} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "72 {'question': 'Who created Wikipedia?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n\\t<http://dbpedia.org/resource/Wikipedia> <http://dbpedia.org/ontology/author> ?uri .\\n}'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "73 {'question': 'Is Rita Wilson the wife of Tom Hanks?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE { \\n        <http://dbpedia.org/resource/Tom_Hanks> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Rita_Wilson> . \\n}'} 5\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "74 {'question': 'Which films did Stanley Kubrick direct?', 'predictions': '1,2', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick> . }'} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "75 {'question': 'How many pages does War and Peace have?', 'predictions': '101,105', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?n\\nWHERE {\\n        <http://dbpedia.org/resource/War_and_Peace> <http://dbpedia.org/ontology/numberOfPages> ?n .\\n}'} 7\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "76 {'question': 'How tall is Claudia Schiffer?', 'predictions': '101,151', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?height \\nWHERE {       \\n        <http://dbpedia.org/resource/Claudia_Schiffer> <http://dbpedia.org/ontology/height> ?height .      \\n}'} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "77 {'question': \"Who was John F. Kennedy's vice president?\", 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/vicePresident> ?uri . \\n}'} 1\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "78 {'question': 'Who was the successor of John F. Kennedy?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/successor> ?uri .\\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "79 {'question': \"Who composed the soundtrack for Cameron's Titanic?\", 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> <http://dbpedia.org/ontology/musicComposer> ?uri . } '} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "80 {'question': 'Which movies did Kurosawa direct?', 'predictions': '1,2', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .\\n        ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Akira_Kurosawa> .\\n}'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "81 {'question': 'In which time zone is Rome?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/timeZone> ?uri . } '} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "82 {'question': 'Give me the currency of China.', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {  \\n   <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?uri . \\n}'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "83 {'question': 'Who are the developers of DBpedia?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/DBpedia> <http://dbpedia.org/ontology/developer> ?uri . }'} 1\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "84 {'question': 'How many inhabitants does the largest city in Canada have?', 'predictions': '101,105', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?num\\nWHERE {\\n        <http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/largestCity> ?city . \\n        ?city <http://dbpedia.org/ontology/populationTotal> ?num .\\n}'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "85 {'question': 'In which military conflicts did Lawrence of Arabia participate?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        <http://dbpedia.org/resource/T._E._Lawrence> <http://dbpedia.org/ontology/battle> ?uri . \\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "86 {'question': 'In which country does the Nile start?', 'predictions': '2,3', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {       \\n        <http://dbpedia.org/resource/Nile> <http://dbpedia.org/ontology/sourceCountry> ?uri .\\n}'} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "87 {'question': 'Which country was Bill Gates born in?', 'predictions': '2,1', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bill_Gates> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri . }'} 16\n",
      "....\n",
      "\n",
      "\n",
      "\n",
      "88 {'question': 'Show me the book that Muhammad Ali wrote.', 'predictions': '1,16', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n         ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . \\n         ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> . \\n}'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "89 {'question': 'Is Michelle Obama the wife of Barack Obama?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE {\\n\\t<http://dbpedia.org/resource/Barack_Obama> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Michelle_Obama> .\\n}'} 8\n",
      "....\n",
      "\n",
      "\n",
      "\n",
      "90 {'question': 'What is the area code of Berlin?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?string \\nWHERE {\\n\\t<http://dbpedia.org/resource/Berlin> <http://dbpedia.org/ontology/areaCode> ?string .\\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "91 {'question': 'Give me all actors starring in Last Action Hero.', 'predictions': '6,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?uri . \\n}'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "92 {'question': 'What are the nicknames of San Francisco?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/San_Francisco> <http://dbpedia.org/property/nickname> ?string . } '} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "93 {'question': 'Which television shows were created by Walt Disney?', 'predictions': '1,6', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n\\t?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow> .\\n        ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Walt_Disney> .\\n}'} 101\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "94 {'question': 'What country is Sitecore from?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sitecore> <http://dbpedia.org/ontology/foundationPlace> ?uri . }'} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "95 {'question': 'Whom did Lance Bass marry?', 'predictions': '1,2', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Lance_Bass> . } '} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "96 {'question': 'What is the capital of Canada?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        <http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> ?uri .\\n}'} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "97 {'question': 'Who was Vincent van Gogh inspired by?', 'predictions': '2,151', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/Vincent_van_Gogh> . }'} 1\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "98 {'question': 'In which city did John F. Kennedy die?', 'predictions': '2,3', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n        <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri .\\n        ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> .\\n}'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "99 {'question': 'Who wrote the Game of Thrones theme?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Game_of_Thrones> <http://dbpedia.org/ontology/composer> ?uri. }'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "100 {'question': 'Who designed the Brooklyn Bridge?', 'predictions': '2,5', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        <http://dbpedia.org/resource/Brooklyn_Bridge> <http://dbpedia.org/ontology/architect> ?uri .\\n}'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "101 {'question': 'Which types of grapes grow in Oregon?', 'predictions': '5,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oregon_wine> <http://dbpedia.org/ontology/growingGrape> ?uri . } '} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "102 {'question': 'How tall is Michael Jordan?', 'predictions': '151,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?num \\nWHERE {\\n        <http://dbpedia.org/resource/Michael_Jordan> <http://dbpedia.org/ontology/height> ?num .\\n}'} 8\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "103 {'question': 'To which party does the mayor of Paris belong?', 'predictions': '2,3', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?x . ?x <http://dbpedia.org/ontology/party> ?uri . }'} 15\n",
      "......\n",
      "\n",
      "\n",
      "\n",
      "104 {'question': 'Who wrote the book The Pillars of the Earth?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n        <http://dbpedia.org/resource/The_Pillars_of_the_Earth> <http://dbpedia.org/ontology/author> ?uri .\\n}'} 3\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "105 {'question': 'How high is the Mount Everest?', 'predictions': '151,101', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?num \\nWHERE {\\n\\t<http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/elevation> ?num.\\n}'} 1\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "106 {'question': 'Who was the doctoral supervisor of Albert Einstein?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Albert_Einstein> <http://dbpedia.org/ontology/doctoralAdvisor> ?uri . }'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "107 {'question': 'What is the currency of the Czech Republic?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n\\t<http://dbpedia.org/resource/Czech_Republic> <http://dbpedia.org/ontology/currency> ?uri .\\n}'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "108 {'question': 'Did Socrates influence Aristotle?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE {\\n\\t<http://dbpedia.org/resource/Aristotle> <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Socrates> .\\n}'} 11\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "109 {'question': 'In which city are the headquarters of the United Nations?', 'predictions': '5,3', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Headquarters_of_the_United_Nations> <http://dbpedia.org/ontology/location> ?uri . ?uri a <http://dbpedia.org/ontology/City> . } '} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "110 {'question': 'Who is the founder of Penguin Books?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE { \\n        <http://dbpedia.org/resource/Penguin_Books> <http://dbpedia.org/ontology/founder> ?uri .\\n}'} 5\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "111 {'question': 'Who is the mayor of Rotterdam?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n        <http://dbpedia.org/resource/Rotterdam> <http://dbpedia.org/ontology/leaderName> ?uri .\\n}'} 2\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "112 {'question': 'Who are the parents of the wife of Juan Carlos I?', 'predictions': '5,6', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE { \\n        <http://dbpedia.org/resource/Juan_Carlos_I_of_Spain> <http://dbpedia.org/ontology/spouse> ?x . \\n        ?x <http://dbpedia.org/ontology/parent> ?uri . \\n}'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "113 {'question': 'Did Tesla win a nobel prize in physics?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE {\\n        <http://dbpedia.org/resource/Nikola_Tesla> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Physics> .\\n}'} 8\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "114 {'question': 'Is proinsulin a protein?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK \\nWHERE {\\n\\t<http://dbpedia.org/resource/Proinsulin> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Protein> .\\n}'} 105\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "115 {'question': 'Who were the parents of Queen Victoria?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri\\nWHERE {\\n         <http://dbpedia.org/resource/Queen_Victoria> <http://dbpedia.org/ontology/parent> ?uri .\\n}'} 5\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "116 {'question': 'Did Kaurismki ever win the Grand Prix at Cannes?', 'predictions': '151,2', 'actual': '151', 'sparql_query': 'ASK WHERE { <http://dbpedia.org/resource/Aki_Kaurismki> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> . }'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "117 {'question': 'Where is Fort Knox located?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Fort_Knox> <http://dbpedia.org/property/location> ?uri . }'} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "118 {'question': 'Where is Syngman Rhee buried?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Syngman_Rhee> <http://dbpedia.org/ontology/restingPlace> ?uri . } '} 6\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "119 {'question': 'What is the timezone in San Pedro de Atacama?', 'predictions': '151,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/San_Pedro_de_Atacama> <http://dbpedia.org/ontology/timeZone> ?uri . } '} 3\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "120 {'question': 'To which artistic movement did the painter of The Three Dancers belong?', 'predictions': '3,2', 'actual': '3', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Three_Dancers> <http://dbpedia.org/ontology/author> ?person .  ?person <http://dbpedia.org/ontology/movement> ?uri . } '} 16\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "121 {'question': \"Show me all books in Asimov's Foundation series.\", 'predictions': '1,8', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series> . } '} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "122 {'question': 'How high is the Yokohama Marine Tower?', 'predictions': '101,151', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?num\\nWHERE {\\n        <http://dbpedia.org/resource/Yokohama_Marine_Tower> <http://dbpedia.org/ontology/height> ?num .\\n}'} 105\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "123 {'question': 'Who developed the video game World of Warcraft?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/World_of_Warcraft> <http://dbpedia.org/ontology/developer> ?uri . \\n}'} 1\n",
      "..\n",
      "\n",
      "\n",
      "\n",
      "124 {'question': 'Who was the pope that founded the Vatican Television?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT ?uri \\nWHERE { \\n         ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Pope> . \\n         <http://dbpedia.org/resource/Vatican_Television_Center> <http://dbpedia.org/ontology/foundedBy> ?uri .\\n}'} 151\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "125 {'question': 'Who composed the music for Harold and Maude?', 'predictions': '7,15', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {\\n\\t<http://dbpedia.org/resource/Harold_and_Maude> <http://dbpedia.org/ontology/musicComposer> ?uri .\\n}'} 151\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "126 {'question': 'Give me all members of Prodigy.', 'predictions': '1,2', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } '} 2\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "127 {'question': 'In which country is Mecca located?', 'predictions': '2,1', 'actual': '2', 'sparql_query': 'SELECT DISTINCT ?uri \\nWHERE {  \\n        <http://dbpedia.org/resource/Mecca> <http://dbpedia.org/ontology/country> ?uri .\\n}'} 15\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "128 {'question': 'What are the five boroughs of New York?', 'predictions': '2,1', 'actual': '1', 'sparql_query': 'SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Borough_(New_York_City)> . }'} 7\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "129 {'question': 'Is Cola a beverage?', 'predictions': '151,1', 'actual': '151', 'sparql_query': 'ASK \\nWHERE {\\n        <http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage> .\\n}'} 3\n"
     ]
    }
   ],
   "source": [
    "# res_df = pd.read_csv('slot_results.csv')\n",
    "with open('data/qald/qald.json', 'r') as f:\n",
    "    qald = json.load(f)\n",
    "\n",
    "answers = {\n",
    "    \"dataset\": {\n",
    "        \"id\": \"LC-QuAD-Custom\",\n",
    "        \"name\": \"LC-QuAD Custom Test Datset\"\n",
    "    },\n",
    "    \"questions\": [\n",
    "        \n",
    "    ]\n",
    "}\n",
    "\n",
    "# answers_to_questions = []\n",
    "start = 0\n",
    "sparql = SPARQLWrapper(\"http://akswnc9.aksw.uni-leipzig.de/dbpedia/sparql\")\n",
    "questions = qald\n",
    "\n",
    "for index in range(start, len(questions)):\n",
    "    print(\"\\n\" * 3)\n",
    "    print(index, questions[index], y_true[index])\n",
    "\n",
    "#     if res_df.loc[index]['Correct'] == False:\n",
    "#         print('SKIPPED')\n",
    "#         continue\n",
    "    \n",
    "#     q = df[df['_id'] == int(ids[index])]\n",
    "#     sparql_query = q['sparql_query'].tolist()[0].strip()\n",
    "    template = int(questions[index]['actual'])\n",
    "    \n",
    "    if template == 151:\n",
    "        answertype = \"Boolean\"\n",
    "    elif template < 100:\n",
    "        answertype = \"ListOfResource\"\n",
    "    else:\n",
    "        answertype = \"Number\"\n",
    "    \n",
    "    detected_entities, entities_list, unique_p = detect_entities(questions[index]['question'], index)\n",
    "        \n",
    "#     detected_entities['p'] = filter_out_entities(list(detected_entities['r'].intersection(entities_list['r'])), detected_entities['p'])\n",
    "#     detected_entities['p'].sort(key = len, reverse=True)\n",
    "    \n",
    "#     detected_entities['r'] = list(detected_entities['r'])\n",
    "#     detected_entities['c'] = filter_out_classes(detected_entities['c'])\n",
    "\n",
    "    detected_entities['r'] = list(detected_entities['r'].intersection(entities_list['r']))\n",
    "    detected_entities['p'] = list(detected_entities['p'].intersection(entities_list['p']))\n",
    "    classes = list(detected_entities['c'].intersection(entities_list['c']))\n",
    "    \n",
    "    if len(classes) == 0:\n",
    "        detected_entities['c'] = filter_out_classes(detected_entities['c'])\n",
    "    else:\n",
    "        detected_entities['c'] = classes\n",
    "        \n",
    "    output, sparql_query = get_answer(detected_entities, y_pred[index][0])\n",
    "    \n",
    "    if len(output) == 0:        \n",
    "        output, sparql_query = get_answer(detected_entities, y_pred[index][1])\n",
    "        \n",
    "    if len(sparql_query) > 0:\n",
    "        sparql.setQuery(sparql_query)\n",
    "        sparql.setReturnFormat(JSON)    \n",
    "        result_set = sparql.query().convert()\n",
    "    else:\n",
    "        result_set = []\n",
    "        \n",
    "    question = {\n",
    "        \"id\": index,\n",
    "        \"metadata\": {\n",
    "            \"answertype\": answertype\n",
    "        },\n",
    "        \"question\": [{\n",
    "            \"language\": \"en\",\n",
    "            \"string\": questions[index]\n",
    "        }],\n",
    "        \"query\": {\n",
    "            \"sparql\": sparql_query\n",
    "        },\n",
    "        \"answers\": result_set\n",
    "    }\n",
    "    \n",
    "    answers_to_questions.append(question)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 227,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "80 Which movies did Kurosawa direct?\n",
      ".80\n",
      "\n",
      "\n",
      "\n",
      "{'r': {'http://dbpedia.org/resource/Akira_Kurosawa'}, 'p': {'http://dbpedia.org/ontology/director'}, 'c': {'http://dbpedia.org/ontology/Film'}} \n",
      "\n",
      "\n",
      " {'r': ['http://dbpedia.org/resource/Akira_Kurosawa', 'http://dbpedia.org/resource/The_Pillars_of_the_Earth'], 'p': ['http://dbpedia.org/ontology/director'], 'c': ['http://dbpedia.org/ontology/Film']}\n",
      "{'head': {'link': [], 'vars': ['uri']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Rhapsody_in_August'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Lower_Depths_(1957_film)'}}, {'uri': {'type': 'uri', 'value': \"http://dbpedia.org/resource/The_Men_Who_Tread_on_the_Tiger's_Tail\"}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Horse_(1941_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Idiot_(1951_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Dreams_(1990_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Seven_Samurai'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Most_Beautiful'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/I_Live_in_Fear'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Those_Who_Make_Tomorrow'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Ran_(film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Scandal_(1950_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Dersu_Uzala_(1975_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Throne_of_Blood'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Madadayo'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/No_Regrets_for_Our_Youth'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/One_Wonderful_Sunday'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Rashomon'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Yojimbo_(film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/High_and_Low_(1963_film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Sanshiro_Sugata'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Sanshiro_Sugata_Part_II'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Sanjuro'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Stray_Dog_(film)'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Red_Beard'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Ikiru'}}, {'uri': {'type': 'uri', 'value': \"http://dbpedia.org/resource/Dodes'ka-den\"}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Kagemusha'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Hidden_Fortress'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Quiet_Duel'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/Drunken_Angel'}}, {'uri': {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Bad_Sleep_Well'}}]}}\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "with open('qald_results.json', 'r') as f:\n",
    "    answers_to_questions = json.load(f)\n",
    "\n",
    "with open('data/qald/qald.json', 'r') as f:\n",
    "    qald = json.load(f)\n",
    "    \n",
    "start = 80\n",
    "questions = qald\n",
    "for index in range(start, start + 1):\n",
    "    answer = answers_to_questions[index]\n",
    "    if answer['answers'] != []:\n",
    "        continue\n",
    "    \n",
    "    if answer['metadata']['answertype'] != 'ListOfResource':\n",
    "        continue\n",
    "    \n",
    "#     if answer['question'][0]['string']['actual'] not in answer['question'][0]['string']['predictions'].split(','):\n",
    "#         continue\n",
    "    \n",
    "    print(index, answer['question'][0]['string']['question'])\n",
    "    \n",
    "    detected_entities, entities_list, unique_p = detect_entities(questions[index]['question'], index)\n",
    "    detected_entities['r'] = list(detected_entities['r'].intersection(entities_list['r'])) + ['http://dbpedia.org/resource/The_Pillars_of_the_Earth']\n",
    "    detected_entities['p'] = list(detected_entities['p'].intersection(entities_list['p']))\n",
    "    classes = list(entities_list['c'])\n",
    "    \n",
    "    if len(classes) == 0:\n",
    "        detected_entities['c'] = [list(detected_entities['c'])[0]]\n",
    "    else:\n",
    "        detected_entities['c'] = classes\n",
    "    \n",
    "    template = int(questions[index]['actual'])\n",
    "    output, sparql_query = get_answer(detected_entities, template)\n",
    "            \n",
    "    if len(sparql_query) > 0:\n",
    "        sparql.setQuery(sparql_query)\n",
    "        sparql.setReturnFormat(JSON)    \n",
    "        result_set = sparql.query().convert()\n",
    "    else:\n",
    "        result_set = []\n",
    "    \n",
    "    answers_to_questions[index]['answers'] = result_set\n",
    "    answers_to_questions[index]['query']['sparql'] = sparql_query\n",
    "\n",
    "    print(index)\n",
    "    print('\\n' * 2)\n",
    "    print(entities_list, '\\n' * 3, detected_entities)    \n",
    "    print(result_set)\n",
    "    print('\\n' * 5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 228,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "# with open('qald_results.json', 'w') as f:\n",
    "#     json.dump(answers_to_questions, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 230,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "with open('qald_results.json', 'r') as f:\n",
    "    answers_to_questions = json.load(f)\n",
    "\n",
    "micro_p = []\n",
    "micro_tp = []\n",
    "micro_fp = []\n",
    "micro_fn = []\n",
    "\n",
    "def get_uris(answers):\n",
    "    uris = set()\n",
    "    if answers != []:\n",
    "        for answer in answers['results']['bindings']:\n",
    "            uris.add(answer[answers['head']['vars'][0]]['value'])\n",
    "    return uris\n",
    "\n",
    "def safe_div(x, y):\n",
    "    if y == 0:\n",
    "        return 0\n",
    "    return x / y\n",
    "\n",
    "for index in range(len(answers_to_questions)):\n",
    "    answertype = answers_to_questions[index]['metadata']['answertype']\n",
    "    \n",
    "    answers = answers_to_questions[index]['answers']\n",
    "    golden_answers = answers_to_questions[index]['golden_answers']\n",
    "    \n",
    "    if answertype == 'ListOfResource':\n",
    "        answers_uris = get_uris(answers)\n",
    "        golden_answers_uris = get_uris(golden_answers)        \n",
    "    else:\n",
    "        answers_uris = set()\n",
    "        golden_answers_uris = set()\n",
    "        \n",
    "        if 'boolean' in answers:\n",
    "            answers_uris.add(answers['boolean'])\n",
    "        golden_answers_uris.add(golden_answers['boolean'])\n",
    "    micro_p.append(len(golden_answers_uris))\n",
    "    micro_tp.append(len(golden_answers_uris.intersection(answers_uris)))\n",
    "    micro_fp.append(len(answers_uris - golden_answers_uris))\n",
    "    micro_fn.append(len(golden_answers_uris - answers_uris))\n",
    "    \n",
    "pr = []\n",
    "r = []\n",
    "f = []\n",
    "for index in range(len(answers_to_questions)):\n",
    "    pr.append(safe_div(micro_tp[index], micro_tp[index] + micro_fp[index]))\n",
    "    r.append(safe_div(micro_tp[index], micro_tp[index] + micro_fn[index]))\n",
    "    f.append(safe_div(2 * pr[index] * r[index], pr[index] + r[index]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 231,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "32"
      ]
     },
     "execution_count": 231,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "micro_tp[80]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 232,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.4164335664335664, 0.4230769230769231, 0.41723076923076924)"
      ]
     },
     "execution_count": 232,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.Series(pr).mean(), pd.Series(r).mean(), pd.Series(f).mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 233,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.7575757575757576, 0.4666666666666667, 0.5775577557755777)"
      ]
     },
     "execution_count": 233,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tp = sum(micro_tp)\n",
    "fp = sum(micro_fp)\n",
    "fn = sum(micro_fn)\n",
    "\n",
    "p_macro = safe_div(tp, tp + fp)\n",
    "r_macro = safe_div(tp, tp + fn)\n",
    "p_macro, r_macro, safe_div(2 * p_macro * r_macro, p_macro + r_macro)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 241,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.612, 0.466, 0.529113172541744)"
      ]
     },
     "execution_count": 241,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p = 0.612\n",
    "r = 0.466\n",
    "p, r, 2 * p * r / (p + r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "36 12\n",
      "46 13\n",
      "74 16\n",
      "80 32\n",
      "101 34\n"
     ]
    }
   ],
   "source": [
    "for i in range(len(micro_fn)):\n",
    "    if micro_fn[i] > 10:\n",
    "        print(i, micro_fn[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[4,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 7,\n",
       " 1,\n",
       " 2,\n",
       " 3,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 3,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 4,\n",
       " 1,\n",
       " 4,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 3,\n",
       " 12,\n",
       " 10,\n",
       " 6,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 7,\n",
       " 7,\n",
       " 13,\n",
       " 2,\n",
       " 1,\n",
       " 2,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 32,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 4,\n",
       " 1,\n",
       " 1,\n",
       " 7,\n",
       " 3,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 16,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 3,\n",
       " 1,\n",
       " 32,\n",
       " 1,\n",
       " 1,\n",
       " 3,\n",
       " 1,\n",
       " 10,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 9,\n",
       " 1,\n",
       " 3,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 34,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 2,\n",
       " 11,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 1,\n",
       " 3,\n",
       " 1,\n",
       " 5,\n",
       " 1]"
      ]
     },
     "execution_count": 157,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "micro_p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?uri WHERE {          ?uri <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John> .         ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> .  }\n",
      "SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Colombo_Lighthouse> <http://dbpedia.org/ontology/height> ?num . } \n",
      "SELECT DISTINCT ?uri  WHERE {  <http://dbpedia.org/resource/Abraham_Lincoln> <http://dbpedia.org/ontology/spouse> ?uri. }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BBC_Wildlife_Specials> <http://dbpedia.org/ontology/presenter> ?uri . }\n",
      "SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Pulp_Fiction> <http://dbpedia.org/ontology/budget> ?n . } \n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heineken> <http://dbpedia.org/ontology/manufacturer> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chile_Route_68> <http://dbpedia.org/ontology/routeEnd> ?uri . } \n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Slack_(software)> . }\n",
      "SELECT DISTINCT ?uri WHERE {           <http://dbpedia.org/resource/Jacques_Chirac> <http://dbpedia.org/ontology/spouse> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {         <http://dbpedia.org/resource/Bruce_Carver> <http://dbpedia.org/ontology/deathCause> ?uri .      }\n",
      "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Weser> <http://dbpedia.org/ontology/city> ?uri . } \n",
      "SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/FC_Porto> <http://dbpedia.org/ontology/ground> ?x . ?x <http://dbpedia.org/ontology/seatingCapacity> ?n . } \n",
      "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Robert_F._Kennedy> <http://dbpedia.org/ontology/child> ?child .  ?child <http://dbpedia.org/ontology/spouse> ?uri . } \n",
      "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Viking_Press> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jack_Kerouac> . } \n",
      "SELECT DISTINCT ?height WHERE {  <http://dbpedia.org/resource/Amazon_Eve> <http://dbpedia.org/ontology/height> ?height . } \n",
      "SELECT DISTINCT ?uri WHERE {        <http://dbpedia.org/resource/The_Scream> <http://dbpedia.org/ontology/museum> ?uri . }\n",
      "SELECT DISTINCT ?uri  WHERE {  <http://dbpedia.org/resource/The_Pillars_of_the_Earth> <http://dbpedia.org/ontology/author> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ceres_(dwarf_planet)> <http://dbpedia.org/ontology/discoverer> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {                <http://dbpedia.org/resource/Brooklyn_Bridge> <http://dbpedia.org/ontology/crosses> ?uri .  }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?uri . }\n",
      "SELECT DISTINCT ?uri  WHERE {          <http://dbpedia.org/resource/French_Polynesia> <http://dbpedia.org/ontology/capital> ?x .         ?x <http://dbpedia.org/ontology/mayor> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {         <http://dbpedia.org/resource/Douglas_Hofstadter> <http://dbpedia.org/ontology/award> ?uri . }\n",
      "SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/The_Lego_Movie> <http://dbpedia.org/ontology/budget> ?n . } \n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Piccadilly>. } \n",
      "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Gere> . } \n",
      "SELECT DISTINCT ?uri  WHERE {          <http://dbpedia.org/resource/Ganges> <http://dbpedia.org/ontology/sourceCountry> ?uri . }\n",
      "ASK WHERE {          <http://dbpedia.org/resource/Barack_Obama> <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Democratic_Party_(United_States)> .  }\n",
      "SELECT DISTINCT ?uri  WHERE {         <http://dbpedia.org/resource/Johann_Sebastian_Bach> <http://dbpedia.org/ontology/birthPlace> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {           <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/firstAscentPerson> ?uri .  }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Poland> <http://dbpedia.org/ontology/populationTotal> ?uri . }  \n",
      "SELECT ?uri WHERE {  <http://dbpedia.org/resource/Palace_of_Westminster> <http://dbpedia.org/ontology/location> ?uri . } \n",
      "ASK WHERE {  <http://dbpedia.org/resource/Batman_Begins> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Christian_Bale> . }\n",
      "SELECT DISTINCT ?uri  WHERE {   <http://dbpedia.org/resource/Limerick_Lake> <http://dbpedia.org/ontology/country> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Family_Guy> <http://dbpedia.org/ontology/creator> ?uri . }  \n",
      "SELECT DISTINCT ?uri WHERE {          <http://dbpedia.org/resource/Suriname> <http://dbpedia.org/ontology/officialLanguage> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hotel_California> <http://dbpedia.org/ontology/writer> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } \n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chocolate_chip_cookie> <http://dbpedia.org/ontology/ingredient> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Carrot_cake> <http://dbpedia.org/ontology/ingredient> ?uri . } \n",
      "ASK WHERE { <http://dbpedia.org/resource/Neymar> <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Real_Madrid_C.F.> . }\n",
      "SELECT DISTINCT ?uri WHERE {         ?uri <http://dbpedia.org/ontology/abbreviation> 'IYCM' . }\n",
      "SELECT ?uri  WHERE {          <http://dbpedia.org/resource/Melbourne,_Florida> <http://dbpedia.org/ontology/populationTotal> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE {          <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/locatedInArea> ?uri .          ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . }\n",
      "SELECT DISTINCT ?uri  WHERE {  <http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/largestCity> ?uri . }\n",
      "SELECT DISTINCT ?uri  WHERE {          ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .           ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> .  }\n",
      "SELECT DISTINCT ?uri  WHERE {          ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .           ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> .  }\n",
      "SELECT DISTINCT ?uri  WHERE {         ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Sopranos> .         ?uri <http://dbpedia.org/ontology/seasonNumber> 1 . }\n",
      "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } \n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gus_Fring> <http://dbpedia.org/ontology/portrayer> ?uri . }\n",
      "SELECT DISTINCT ?uri  WHERE {   <http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Cocoa_bean> . }\n",
      "SELECT DISTINCT ?uri  WHERE {         <http://dbpedia.org/resource/Forbes> <http://dbpedia.org/ontology/editor> ?uri . }\n",
      "SELECT DISTINCT ?num  WHERE {         <http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/capital> ?x .         ?x <http://dbpedia.org/ontology/populationTotal> ?num . }\n",
      "SELECT DISTINCT ?uri  WHERE {          ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Surfing> .         ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Australia> . }\n",
      "SELECT DISTINCT ?uri  WHERE {       ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame> .       ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software> .  }\n",
      "SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/Aldi> <http://dbpedia.org/ontology/numberOfLocations> ?number . } \n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cameroon> <http://dbpedia.org/ontology/capital> ?uri. } \n",
      "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . } \n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mickey_Rourke> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> . } \n",
      "SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Count_Dracula> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/deathDate> ?date . } \n",
      "SELECT DISTINCT ?uri  WHERE {  <http://dbpedia.org/resource/Miffy> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/nationality> ?uri . }\n",
      "SELECT DISTINCT ?s WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/alterEgo> ?s . }\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/governmentType> ?uri . } \n",
      "SELECT DISTINCT ?uri  WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RecordLabel> .         ?uri <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Grunge> .         ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Canada> . }\n",
      "SELECT DISTINCT ?uri  WHERE {  <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?uri . }\n"
     ]
    }
   ],
   "source": [
    "with open('qald_results.json', 'r') as f:\n",
    "    answers_to_questions = json.load(f)\n",
    "    \n",
    "for index in range(len(answers_to_questions)):\n",
    "    answer = answers_to_questions[index]\n",
    "    \n",
    "    print(answer['question'][0]['string']['sparql_query'].replace('\\n', ' ').replace('\\t', ' '))\n",
    "    sparql.setQuery(answer['question'][0]['string']['sparql_query'].replace('\\n', ' ').replace('\\t', ' '))\n",
    "    sparql.setReturnFormat(JSON)    \n",
    "    result_set = sparql.query().convert()\n",
    "    answers_to_questions[index]['golden_answers'] = result_set"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "68"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/governingBody> <http://dbpedia.org/resource/Philadelphia_City_Council> }\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/governingBody> <http://dbpedia.org/resource/Philadelphia_City_Council> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Company> } }\n",
      "963\n"
     ]
    }
   ],
   "source": [
    "detected_entities\n",
    "q = df[df['_id'] == int(ids[0])]\n",
    "print(q['sparql_query'].tolist()[0].strip())\n",
    "print(answers_to_questions[0]['query']['sparql'])\n",
    "print(index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 421,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "with open('answers_model.json', 'r') as f:\n",
    "    answers_model = json.load(f)\n",
    "\n",
    "with open('golden_answers.json', 'r') as f:\n",
    "    golden_answers = json.load(f)['questions']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 424,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/portrayer'], 'c': ['http://dbpedia.org/ontology/FictionalCharacter']}\n",
      "{'r': {'http://dbpedia.org/resource/Terminator_(franchise)', 'http://dbpedia.org/resource/Terminator_2:_Judgment_Day'}, 'p': {'http://dbpedia.org/ontology/portrayer', 'http://dbpedia.org/ontology/series'}, 'c': {'http://dbpedia.org/ontology/FictionalCharacter'}}\n",
      "3 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Mariveles,_Bataan'], 'p': ['http://dbpedia.org/ontology/sport'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Mariveles,_Bataan'}, 'p': {'http://dbpedia.org/ontology/sport', 'http://dbpedia.org/property/city'}, 'c': set()}\n",
      "6 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Ganz_UV'], 'p': ['http://dbpedia.org/ontology/nationality', 'http://dbpedia.org/ontology/operator'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Gza_Horvth', 'http://dbpedia.org/resource/Ganz_UV'}, 'p': {'http://dbpedia.org/ontology/nationality', 'http://dbpedia.org/ontology/operator'}, 'c': set()}\n",
      "\n",
      "\n",
      " 8\n",
      "18\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/Starwood_Hotels_and_Resorts_Worldwide> . ?x <http://dbpedia.org/property/address> ?uri  . }\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Starwood_Hotels_and_Resorts_Worldwide> <http://dbpedia.org/property/operator> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "9 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Continental_Army'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Continental_Army'}, 'p': {'http://dbpedia.org/ontology/militaryBranch'}, 'c': set()}\n",
      "11 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Midhurst'], 'p': ['http://dbpedia.org/ontology/deathPlace'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Midhurst'}, 'p': {'http://dbpedia.org/ontology/creator', 'http://dbpedia.org/ontology/deathPlace'}, 'c': set()}\n",
      "13 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/subject', 'http://dbpedia.org/property/meaning'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/The_Prodigal_Son_(play)', 'http://dbpedia.org/resource/Isa_(name)'}, 'p': {'http://dbpedia.org/property/subject', 'http://dbpedia.org/property/meaning'}, 'c': set()}\n",
      "14 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/mascot'], 'c': ['http://dbpedia.org/ontology/School']}\n",
      "{'r': {'http://dbpedia.org/resource/Bison'}, 'p': {'http://dbpedia.org/property/mascot'}, 'c': {'http://dbpedia.org/ontology/School'}}\n",
      "15 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/French_Southern_and_Antarctic_Lands'], 'p': ['http://dbpedia.org/ontology/currency', 'http://dbpedia.org/property/currency'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Republic_of_Montenegro_(19922006)', 'http://dbpedia.org/resource/French_Southern_and_Antarctic_Lands'}, 'p': {'http://dbpedia.org/ontology/currency', 'http://dbpedia.org/property/currency'}, 'c': set()}\n",
      "17 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Guggenheim_family'], 'p': ['http://dbpedia.org/property/founder'], 'c': ['http://dbpedia.org/ontology/BaseballTeam']}\n",
      "{'r': {'http://dbpedia.org/resource/Guggenheim_family'}, 'p': {'http://dbpedia.org/property/owner', 'http://dbpedia.org/property/founder'}, 'c': {'http://dbpedia.org/ontology/BaseballTeam'}}\n",
      "19 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Ford_Motor_Credit_Company'], 'p': ['http://dbpedia.org/property/owner'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Dagenham_wind_turbines', 'http://dbpedia.org/resource/Ford_Motor_Credit_Company'}, 'p': {'http://dbpedia.org/property/owner'}, 'c': set()}\n",
      "21 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Before_I_Let_You_Go'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Before_I_Let_You_Go', 'http://dbpedia.org/resource/The_Conglomerate_(American_group)'}, 'p': {'http://dbpedia.org/ontology/musicalArtist', 'http://dbpedia.org/property/pastMembers'}, 'c': set()}\n",
      "23 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Saunders_County,_Nebraska'], 'p': ['http://dbpedia.org/ontology/state'], 'c': ['http://dbpedia.org/ontology/Stream']}\n",
      "{'r': {'http://dbpedia.org/resource/Saunders_County,_Nebraska'}, 'p': {'http://dbpedia.org/property/mouthLocation', 'http://dbpedia.org/ontology/state'}, 'c': {'http://dbpedia.org/ontology/Stream'}}\n",
      "24 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/CFRX'], 'p': ['http://dbpedia.org/ontology/broadcastArea'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/CFRX', 'http://dbpedia.org/resource/Anthony_Raymond_Ceresko'}, 'p': {'http://dbpedia.org/property/placeOfBirth', 'http://dbpedia.org/ontology/broadcastArea'}, 'c': set()}\n",
      "27 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': []}\n",
      "{'r': {\"http://dbpedia.org/resource/Judge_Advocate_General's_Corps,_United_States_Army\"}, 'p': {'http://dbpedia.org/ontology/militaryRank', 'http://dbpedia.org/ontology/almaMater'}, 'c': set()}\n",
      "28 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': ['http://dbpedia.org/ontology/Sea']}\n",
      "{'r': {'http://dbpedia.org/resource/Europe'}, 'p': {'http://dbpedia.org/ontology/location'}, 'c': {'http://dbpedia.org/ontology/Sea'}}\n",
      "29 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Edsel_Ranger'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Edsel_Ranger'}, 'p': {'http://dbpedia.org/property/parent', 'http://dbpedia.org/property/products'}, 'c': set()}\n",
      "33 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': []}\n",
      "{'r': {\"http://dbpedia.org/resource/Soccer_Bowl_'76\"}, 'p': {'http://dbpedia.org/ontology/city'}, 'c': set()}\n",
      "36 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Massachusetts_House_of_Representatives'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Massachusetts_House_of_Representatives'}, 'p': {'http://dbpedia.org/property/office'}, 'c': set()}\n",
      "37 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/The_Shirelles'], 'p': [], 'c': ['http://dbpedia.org/ontology/Artist']}\n",
      "{'r': {'http://dbpedia.org/resource/The_Shirelles'}, 'p': {'http://dbpedia.org/ontology/associatedBand', 'http://dbpedia.org/ontology/occupation'}, 'c': {'http://dbpedia.org/ontology/Artist'}}\n",
      "39 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Juelz_Santana'], 'p': [], 'c': ['http://dbpedia.org/ontology/Person']}\n",
      "{'r': {'http://dbpedia.org/resource/Juelz_Santana'}, 'p': {'http://dbpedia.org/ontology/bandMember', 'http://dbpedia.org/property/currentMembers'}, 'c': {'http://dbpedia.org/ontology/Person'}}\n",
      "\n",
      "\n",
      " 41\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_Madison> <http://dbpedia.org/ontology/relation> ?uri. <http://dbpedia.org/resource/Levi_Lincoln,_Sr.> <http://dbpedia.org/property/successor> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Levi_Lincoln,_Sr.> <http://dbpedia.org/property/successor> ?uri. <http://dbpedia.org/resource/George_Madison> <http://dbpedia.org/property/successor> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "42 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Sam_Sen_Railway_Station'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Sam_Sen_Railway_Station'}, 'p': {'http://dbpedia.org/property/other'}, 'c': set()}\n",
      "46 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/ung_River'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/ung_River'}, 'p': {'http://dbpedia.org/ontology/sourceCountry'}, 'c': set()}\n",
      "47 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Marlboro_Township,_New_Jersey'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Marlboro_Township,_New_Jersey'}, 'p': {'http://dbpedia.org/property/homeTown'}, 'c': set()}\n",
      "49 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/ABC_Records'], 'p': ['http://dbpedia.org/property/voices'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/ABC_Records'}, 'p': {'http://dbpedia.org/property/voices', 'http://dbpedia.org/property/label'}, 'c': {'http://dbpedia.org/ontology/TelevisionShow'}}\n",
      "50 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/1951_Asian_Games'], 'p': ['http://dbpedia.org/ontology/largestCity'], 'c': ['http://dbpedia.org/ontology/Country']}\n",
      "{'r': {'http://dbpedia.org/resource/1951_Asian_Games'}, 'p': {'http://dbpedia.org/ontology/largestCity', 'http://dbpedia.org/property/hostCity'}, 'c': {'http://dbpedia.org/ontology/Country'}}\n",
      "51 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Joey_McIntyre'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Joey_McIntyre'}, 'p': {'http://dbpedia.org/property/starring'}, 'c': set()}\n",
      "53 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Tonl_Sap'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Tonl_Sap'}, 'p': {'http://dbpedia.org/ontology/rightTributary'}, 'c': set()}\n",
      "60 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Pittsburgh_Line'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Pittsburgh_Line'}, 'p': {'http://dbpedia.org/ontology/founder', 'http://dbpedia.org/ontology/routeEnd'}, 'c': set()}\n",
      "62 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Henri_Putz'], 'p': ['http://dbpedia.org/ontology/battle'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Henri_Putz'}, 'p': {'http://dbpedia.org/ontology/battle', 'http://dbpedia.org/ontology/territory'}, 'c': set()}\n",
      "64 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': ['http://dbpedia.org/ontology/AmericanFootballTeam']}\n",
      "{'r': {'http://dbpedia.org/resource/O.co_Coliseum'}, 'p': {'http://dbpedia.org/ontology/locationCity'}, 'c': {'http://dbpedia.org/ontology/AmericanFootballTeam'}}\n",
      "66 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Cinema_International_Corporation'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Cinema_International_Corporation'}, 'p': {'http://dbpedia.org/ontology/distributor'}, 'c': set()}\n",
      "67 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/owners'], 'c': ['http://dbpedia.org/ontology/Newspaper']}\n",
      "{'r': {'http://dbpedia.org/resource/Rolv_Erik_Ryssdal'}, 'p': {'http://dbpedia.org/ontology/keyPerson', 'http://dbpedia.org/property/owners'}, 'c': {'http://dbpedia.org/ontology/Newspaper'}}\n",
      "69 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/album', 'http://dbpedia.org/property/producer'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Money_(Pink_Floyd_song)'}, 'p': {'http://dbpedia.org/property/album', 'http://dbpedia.org/property/producer'}, 'c': set()}\n",
      "70 NO RECORDS IT SEEMS []\n",
      "{'r': [\"http://dbpedia.org/resource/John_O'Connor_(archbishop_of_New_York)\"], 'p': [], 'c': []}\n",
      "{'r': {\"http://dbpedia.org/resource/John_O'Connor_(archbishop_of_New_York)\"}, 'p': {'http://dbpedia.org/ontology/almaMater'}, 'c': set()}\n",
      "71 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Neungin_High_School'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Wickramabahu_Central_College_(National_School)', 'http://dbpedia.org/resource/Neungin_High_School'}, 'p': {'http://dbpedia.org/property/religiousAffiliation'}, 'c': set()}\n",
      "\n",
      "\n",
      " 73\n",
      "3\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/debutteam> <http://dbpedia.org/resource/New_York_Yankees> . ?x <http://dbpedia.org/ontology/team> ?uri  . }\n",
      "16\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/New_York_Yankees> . ?x <http://dbpedia.org/ontology/team> ?uri . OPTIONAL { ?x rdf:type <http://dbpedia.org/ontology/Play> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "76 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Ryan_Powell_(lacrosse)'], 'p': ['http://dbpedia.org/ontology/team'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Ryan_Powell_(lacrosse)', 'http://dbpedia.org/resource/Michael_Powell_(lacrosse)'}, 'p': {'http://dbpedia.org/ontology/team'}, 'c': set()}\n",
      "77 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/CBS'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/CBS'}, 'p': {'http://dbpedia.org/ontology/occupation'}, 'c': set()}\n",
      "\n",
      "\n",
      " 80\n",
      "6\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> . ?x <http://dbpedia.org/ontology/athletics> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Lanao_del_Sur> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/University> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "82 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Olin_Corporation'], 'p': ['http://dbpedia.org/ontology/knownFor'], 'c': ['http://dbpedia.org/ontology/BaseballPlayer']}\n",
      "{'r': {'http://dbpedia.org/resource/Olin_Corporation'}, 'p': {'http://dbpedia.org/property/education', 'http://dbpedia.org/ontology/knownFor'}, 'c': {'http://dbpedia.org/ontology/BaseballPlayer'}}\n",
      "\n",
      "\n",
      " 87\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/PyChess> <http://dbpedia.org/property/genre> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Craig_Van_Tilbury> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Genre> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "89 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Palo_Alto,_California'], 'p': ['http://dbpedia.org/ontology/award', 'http://dbpedia.org/property/restingPlace'], 'c': ['http://dbpedia.org/ontology/Person']}\n",
      "{'r': {'http://dbpedia.org/resource/Screen_Actors_Guild_Life_Achievement_Award', 'http://dbpedia.org/resource/Palo_Alto,_California'}, 'p': {'http://dbpedia.org/ontology/award', 'http://dbpedia.org/property/restingPlace'}, 'c': {'http://dbpedia.org/ontology/Person'}}\n",
      "90 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Kelsey_Creek'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Kelsey_Creek'}, 'p': {'http://dbpedia.org/ontology/region', 'http://dbpedia.org/ontology/countySeat'}, 'c': set()}\n",
      "\n",
      "\n",
      " 94\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pulau_Ubin> <http://dbpedia.org/ontology/capital> ?uri. <http://dbpedia.org/resource/Nicole_Lai> <http://dbpedia.org/ontology/restingPlace> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pulau_Ubin> <http://dbpedia.org/ontology/restingPlace> ?uri. <http://dbpedia.org/resource/Nicole_Lai> <http://dbpedia.org/ontology/restingPlace> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "95 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Koay_Teng_Hai'], 'p': ['http://dbpedia.org/property/fields', 'http://dbpedia.org/ontology/religion'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Paul_Demiville', 'http://dbpedia.org/resource/Koay_Teng_Hai'}, 'p': {'http://dbpedia.org/property/fields', 'http://dbpedia.org/ontology/religion'}, 'c': set()}\n",
      "106 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Argentina'], 'p': ['http://dbpedia.org/ontology/genre'], 'c': ['http://dbpedia.org/ontology/MusicGenre']}\n",
      "{'r': {'http://dbpedia.org/resource/Argentina'}, 'p': {'http://dbpedia.org/ontology/hometown', 'http://dbpedia.org/ontology/genre'}, 'c': {'http://dbpedia.org/ontology/MusicGenre'}}\n",
      "111 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/owner'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Victoria_(ship)'}, 'p': {'http://dbpedia.org/ontology/owner'}, 'c': set()}\n",
      "120 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/American_Classical_League'], 'p': ['http://dbpedia.org/ontology/academicDiscipline'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/American_Classical_League', 'http://dbpedia.org/resource/Probus_(journal)'}, 'p': {'http://dbpedia.org/ontology/academicDiscipline', 'http://dbpedia.org/property/motto'}, 'c': set()}\n",
      "\n",
      "\n",
      " 122\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction> . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/PCL_Construction> . ?x <http://dbpedia.org/ontology/tenant> ?uri }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "129 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Regiment_of_Mounted_Grenadiers'], 'p': ['http://dbpedia.org/ontology/militaryRank'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Regiment_of_Mounted_Grenadiers'}, 'p': {'http://dbpedia.org/ontology/militaryRank', 'http://dbpedia.org/property/notableCommanders'}, 'c': set()}\n",
      "139 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Brown_hair'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Brown_hair'}, 'p': {'http://dbpedia.org/ontology/residence', 'http://dbpedia.org/property/hairColor'}, 'c': set()}\n",
      "140 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/sport'], 'c': ['http://dbpedia.org/ontology/Sport']}\n",
      "{'r': {'http://dbpedia.org/resource/Maharashtra'}, 'p': {'http://dbpedia.org/property/state', 'http://dbpedia.org/ontology/sport'}, 'c': {'http://dbpedia.org/ontology/Sport'}}\n",
      "\n",
      "\n",
      " 142\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Manendragarh> <http://dbpedia.org/ontology/leaderName> ?uri. <http://dbpedia.org/resource/Rishang_Keishing> <http://dbpedia.org/property/party> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rishang_Keishing> <http://dbpedia.org/property/party> ?uri. <http://dbpedia.org/resource/Manendragarh> <http://dbpedia.org/property/party> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "143 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/country', 'http://dbpedia.org/property/capital'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Bocas_Town,_Bocas_del_Toro'}, 'p': {'http://dbpedia.org/property/country', 'http://dbpedia.org/property/capital'}, 'c': set()}\n",
      "146 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/divisions', 'http://dbpedia.org/property/distributor'], 'c': ['http://dbpedia.org/ontology/TelevisionShow']}\n",
      "{'r': {'http://dbpedia.org/resource/Warner_Bros._International_Television'}, 'p': {'http://dbpedia.org/property/divisions', 'http://dbpedia.org/property/distributor'}, 'c': {'http://dbpedia.org/ontology/TelevisionShow'}}\n",
      "147 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/awards', 'http://dbpedia.org/ontology/editing'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/The_Search_(2014_film)'}, 'p': {'http://dbpedia.org/property/awards', 'http://dbpedia.org/ontology/editing'}, 'c': set()}\n",
      "149 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Burbank,_California'], 'p': ['http://dbpedia.org/property/distributor', 'http://dbpedia.org/ontology/locationCity'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Burbank,_California'}, 'p': {'http://dbpedia.org/property/distributor', 'http://dbpedia.org/ontology/locationCity'}, 'c': {'http://dbpedia.org/ontology/TelevisionShow'}}\n",
      "150 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Guggenheim_Partners'], 'p': [], 'c': ['http://dbpedia.org/ontology/BaseballTeam']}\n",
      "{'r': {'http://dbpedia.org/resource/Guggenheim_Partners'}, 'p': {'http://dbpedia.org/property/owner'}, 'c': {'http://dbpedia.org/ontology/BaseballTeam'}}\n",
      "154 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Marcus_Calpurnius_Bibulus'], 'p': ['http://dbpedia.org/ontology/associate'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Marcus_Calpurnius_Bibulus', 'http://dbpedia.org/resource/Publius_Servilius_Vatia_Isauricus_(consul_48_BC)'}, 'p': {'http://dbpedia.org/ontology/associate'}, 'c': set()}\n",
      "156 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/knownFor', 'http://dbpedia.org/ontology/religion'], 'c': []}\n",
      "{'r': {\"http://dbpedia.org/resource/People's_Bank_(Sri_Lanka)\"}, 'p': {'http://dbpedia.org/ontology/knownFor', 'http://dbpedia.org/ontology/religion'}, 'c': set()}\n",
      "\n",
      "\n",
      " 158\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liliya_Lobanova> <http://dbpedia.org/property/birthplace> ?uri. <http://dbpedia.org/resource/Snake_Island_(Black_Sea)> <http://dbpedia.org/property/locationCountry> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Snake_Island_(Black_Sea)> <http://dbpedia.org/property/birthplace> ?uri. <http://dbpedia.org/resource/Liliya_Lobanova> <http://dbpedia.org/property/birthplace> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "159 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Waylon_Jennings'], 'p': [], 'c': ['http://dbpedia.org/ontology/MusicalArtist']}\n",
      "{'r': {'http://dbpedia.org/resource/Waylon_Jennings'}, 'p': {'http://dbpedia.org/ontology/associatedMusicalArtist'}, 'c': {'http://dbpedia.org/ontology/MusicalArtist'}}\n",
      "161 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Vangelis'], 'p': ['http://dbpedia.org/property/music', 'http://dbpedia.org/ontology/cinematography'], 'c': ['http://dbpedia.org/ontology/Film']}\n",
      "{'r': {'http://dbpedia.org/resource/Jordan_Cronenweth', 'http://dbpedia.org/resource/Vangelis'}, 'p': {'http://dbpedia.org/property/music', 'http://dbpedia.org/ontology/cinematography'}, 'c': {'http://dbpedia.org/ontology/Film'}}\n",
      "162 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/GetTV'], 'p': ['http://dbpedia.org/ontology/parentOrganisation'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Next_Thing', 'http://dbpedia.org/resource/GetTV'}, 'p': {'http://dbpedia.org/ontology/recordLabel', 'http://dbpedia.org/ontology/parentOrganisation'}, 'c': set()}\n",
      "163 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Julian_Gingell', 'http://dbpedia.org/resource/Fox_Broadcasting_Company'], 'p': [], 'c': ['http://dbpedia.org/ontology/TelevisionShow']}\n",
      "{'r': {'http://dbpedia.org/resource/Julian_Gingell', 'http://dbpedia.org/resource/Fox_Broadcasting_Company'}, 'p': {'http://dbpedia.org/property/channel', 'http://dbpedia.org/property/themeMusicComposer'}, 'c': {'http://dbpedia.org/ontology/TelevisionShow'}}\n",
      "170 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Jason_Hayne'}, 'p': {'http://dbpedia.org/ontology/currentMember', 'http://dbpedia.org/property/name'}, 'c': {'http://dbpedia.org/ontology/OrganisationMember'}}\n",
      "172 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Microsoft_Office_Picture_Manager'], 'p': ['http://dbpedia.org/ontology/license'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Microsoft_Office_Picture_Manager', 'http://dbpedia.org/resource/Google_Cloud_Connect'}, 'p': {'http://dbpedia.org/ontology/computingPlatform', 'http://dbpedia.org/ontology/license'}, 'c': set()}\n",
      "173 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/foundedBy'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Jim_Harris_(entrepreneur)'}, 'p': {'http://dbpedia.org/ontology/foundedBy'}, 'c': set()}\n",
      "174 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/museum', 'http://dbpedia.org/property/artist'], 'c': ['http://dbpedia.org/ontology/Artist']}\n",
      "{'r': {'http://dbpedia.org/resource/So_Paulo_Museum_of_Art'}, 'p': {'http://dbpedia.org/property/museum', 'http://dbpedia.org/property/artist'}, 'c': {'http://dbpedia.org/ontology/Artist'}}\n",
      "\n",
      "\n",
      " 176\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> . ?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Indiana_Territory>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Indiana_Territory> . ?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/OfficeHolder> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "177 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Solon_Spencer_Beman'], 'p': ['http://dbpedia.org/ontology/architect'], 'c': ['http://dbpedia.org/ontology/Building']}\n",
      "{'r': {'http://dbpedia.org/resource/Solon_Spencer_Beman'}, 'p': {'http://dbpedia.org/property/locationTown', 'http://dbpedia.org/ontology/architect'}, 'c': {'http://dbpedia.org/ontology/Building'}}\n",
      "180 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/mouthCountry', 'http://dbpedia.org/ontology/wineRegion'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Upper_Neretva', 'http://dbpedia.org/resource/Bogdanua'}, 'p': {'http://dbpedia.org/ontology/mouthCountry', 'http://dbpedia.org/ontology/wineRegion'}, 'c': set()}\n",
      "184 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': [], 'c': ['http://dbpedia.org/ontology/OfficeHolder']}\n",
      "{'r': {'http://dbpedia.org/resource/Montpelier_(Orange,_Virginia)'}, 'p': {'http://dbpedia.org/property/restingplace'}, 'c': {'http://dbpedia.org/ontology/OfficeHolder'}}\n",
      "186 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Trade_association'], 'p': ['http://dbpedia.org/ontology/regionServed'], 'c': ['http://dbpedia.org/ontology/Organisation']}\n",
      "{'r': {'http://dbpedia.org/resource/Trade_association'}, 'p': {'http://dbpedia.org/ontology/type', 'http://dbpedia.org/ontology/regionServed'}, 'c': {'http://dbpedia.org/ontology/Organisation'}}\n",
      "191 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/property/artist'], 'c': ['http://dbpedia.org/ontology/Artist']}\n",
      "{'r': {\"http://dbpedia.org/resource/Muse_d'Orsay\"}, 'p': {'http://dbpedia.org/property/museum', 'http://dbpedia.org/property/artist'}, 'c': {'http://dbpedia.org/ontology/Artist'}}\n",
      "192 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Willard_Fiske'], 'p': [], 'c': ['http://dbpedia.org/ontology/AcademicJournal']}\n",
      "{'r': {'http://dbpedia.org/resource/Willard_Fiske'}, 'p': {'http://dbpedia.org/property/discipline', 'http://dbpedia.org/property/editor'}, 'c': {'http://dbpedia.org/ontology/AcademicJournal'}}\n",
      "193 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Pope_Gregory_I', 'http://dbpedia.org/resource/Edwin_of_Northumbria'], 'p': [], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Pope_Gregory_I', 'http://dbpedia.org/resource/Edwin_of_Northumbria'}, 'p': {'http://dbpedia.org/property/veneratedIn'}, 'c': set()}\n",
      "194 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Latania_verschaffeltii'], 'p': ['http://dbpedia.org/property/awards'], 'c': ['http://dbpedia.org/ontology/Person']}\n",
      "{'r': {'http://dbpedia.org/resource/Latania_verschaffeltii'}, 'p': {'http://dbpedia.org/property/awards', 'http://dbpedia.org/property/binomialAuthority'}, 'c': {'http://dbpedia.org/ontology/Person'}}\n",
      "198 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Middlesbrough_F.C.'], 'p': [], 'c': ['http://dbpedia.org/ontology/Person']}\n",
      "{'r': {'http://dbpedia.org/resource/Middlesbrough_F.C.'}, 'p': {'http://dbpedia.org/ontology/team', 'http://dbpedia.org/ontology/manager'}, 'c': {'http://dbpedia.org/ontology/Person'}}\n",
      "204 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Alana_Stewart'], 'p': ['http://dbpedia.org/property/music'], 'c': []}\n",
      "{'r': {\"http://dbpedia.org/resource/Tonight's_the_Night_(2003_musical)\", 'http://dbpedia.org/resource/Alana_Stewart'}, 'p': {'http://dbpedia.org/ontology/spouse', 'http://dbpedia.org/property/music'}, 'c': set()}\n",
      "206 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Joe_McKeehen'], 'p': ['http://dbpedia.org/property/founded'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Joe_McKeehen'}, 'p': {'http://dbpedia.org/property/champion', 'http://dbpedia.org/property/founded'}, 'c': {'http://dbpedia.org/ontology/SportsLeague'}}\n",
      "207 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/sport'], 'c': ['http://dbpedia.org/ontology/School']}\n",
      "{'r': {'http://dbpedia.org/resource/Harvest_Christian_Center'}, 'p': {'http://dbpedia.org/ontology/sport', 'http://dbpedia.org/property/religiousAffiliation'}, 'c': {'http://dbpedia.org/ontology/School'}}\n",
      "208 NO RECORDS IT SEEMS []\n",
      "{'r': [], 'p': ['http://dbpedia.org/ontology/award', 'http://dbpedia.org/ontology/director'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/The_Haunted_House_(1929_film)'}, 'p': {'http://dbpedia.org/ontology/award', 'http://dbpedia.org/ontology/director'}, 'c': set()}\n",
      "\n",
      "\n",
      " 209\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mojo_Priest> <http://dbpedia.org/property/artist> ?uri. <http://dbpedia.org/resource/On_Deadly_Ground> <http://dbpedia.org/property/director> ?uri . }\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mojo_Priest> <http://dbpedia.org/property/director> ?uri. <http://dbpedia.org/resource/On_Deadly_Ground> <http://dbpedia.org/property/director> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "212 NO RECORDS IT SEEMS []\n",
      "{'r': ['http://dbpedia.org/resource/Sweden'], 'p': ['http://dbpedia.org/ontology/ingredient'], 'c': []}\n",
      "{'r': {'http://dbpedia.org/resource/Sweden'}, 'p': {'http://dbpedia.org/ontology/country', 'http://dbpedia.org/ontology/ingredient'}, 'c': set()}\n",
      "\n",
      "\n",
      " 214\n",
      "2090\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Kevin_Tsujihara> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Kevin_Tsujihara> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Film> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "220 NO RECORDS IT SEEMS []\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mTypeError\u001B[0m                                 Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-424-3706e78f5a6c>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m()\u001B[0m\n\u001B[1;32m     17\u001B[0m         \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 18\u001B[0;31m             \u001B[0;32mfor\u001B[0m \u001B[0mi\u001B[0m \u001B[0;32min\u001B[0m \u001B[0manswers_model\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'answers'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'results'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'bindings'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     19\u001B[0m                 \u001B[0mm_answers\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0madd\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mi\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mvar\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'value'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mTypeError\u001B[0m: list indices must be integers or slices, not str",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001B[0;31mTypeError\u001B[0m                                 Traceback (most recent call last)",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36m_make_request\u001B[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001B[0m\n\u001B[1;32m    379\u001B[0m             \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m  \u001B[0;31m# Python 2.7, use buffering of HTTP responses\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 380\u001B[0;31m                 \u001B[0mhttplib_response\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mconn\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mgetresponse\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mbuffering\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0;32mTrue\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    381\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mTypeError\u001B[0m\u001B[0;34m:\u001B[0m  \u001B[0;31m# Python 2.6 and older, Python 3\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mTypeError\u001B[0m: getresponse() got an unexpected keyword argument 'buffering'",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001B[0;31mKeyboardInterrupt\u001B[0m                         Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-424-3706e78f5a6c>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m()\u001B[0m\n\u001B[1;32m     30\u001B[0m             \u001B[0mprint\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m'NO RECORDS IT SEEMS'\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0manswers_model\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'answers'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     31\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 32\u001B[0;31m             \u001B[0mdetected_entities\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mentities_list\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0munique_p\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mdetect_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestions\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     33\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     34\u001B[0m             \u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mlist\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mintersection\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mentities_list\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m<ipython-input-26-5a8dba152bcb>\u001B[0m in \u001B[0;36mdetect_entities\u001B[0;34m(question, index)\u001B[0m\n\u001B[1;32m      1\u001B[0m \u001B[0;32mdef\u001B[0m \u001B[0mdetect_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mindex\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      2\u001B[0m     \u001B[0mentities_list\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_entities_from_answer\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mids\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0mindex\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m----> 3\u001B[0;31m     \u001B[0mdetected_entities\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_earl_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m      4\u001B[0m     \u001B[0mdetected_entities\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m'r'\u001B[0m\u001B[0;34m]\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mget_tag_me_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;34m+\u001B[0m \u001B[0mget_spotlight_entities\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mquestion\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      5\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m<ipython-input-10-e9d426b7b9c1>\u001B[0m in \u001B[0;36mget_earl_entities\u001B[0;34m(query)\u001B[0m\n\u001B[1;32m     13\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     14\u001B[0m     response = requests.post('http://sda.tech/earl/api/processQuery', \n\u001B[0;32m---> 15\u001B[0;31m                              json={\"nlquery\": query, \"pagerankflag\": False})\n\u001B[0m\u001B[1;32m     16\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     17\u001B[0m     \u001B[0mjson_response\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mjson\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mloads\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mresponse\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mtext\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/requests/api.py\u001B[0m in \u001B[0;36mpost\u001B[0;34m(url, data, json, **kwargs)\u001B[0m\n\u001B[1;32m    110\u001B[0m     \"\"\"\n\u001B[1;32m    111\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 112\u001B[0;31m     \u001B[0;32mreturn\u001B[0m \u001B[0mrequest\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m'post'\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0murl\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mdata\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mdata\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mjson\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mjson\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    113\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    114\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/requests/api.py\u001B[0m in \u001B[0;36mrequest\u001B[0;34m(method, url, **kwargs)\u001B[0m\n\u001B[1;32m     56\u001B[0m     \u001B[0;31m# cases, and look like a memory leak in others.\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     57\u001B[0m     \u001B[0;32mwith\u001B[0m \u001B[0msessions\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mSession\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;32mas\u001B[0m \u001B[0msession\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 58\u001B[0;31m         \u001B[0;32mreturn\u001B[0m \u001B[0msession\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mrequest\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mmethod\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mmethod\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0murl\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0murl\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     59\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     60\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/requests/sessions.py\u001B[0m in \u001B[0;36mrequest\u001B[0;34m(self, method, url, params, data, headers, cookies, files, auth, timeout, allow_redirects, proxies, hooks, stream, verify, cert, json)\u001B[0m\n\u001B[1;32m    506\u001B[0m         }\n\u001B[1;32m    507\u001B[0m         \u001B[0msend_kwargs\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mupdate\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0msettings\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 508\u001B[0;31m         \u001B[0mresp\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0msend\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mprep\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0msend_kwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    509\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    510\u001B[0m         \u001B[0;32mreturn\u001B[0m \u001B[0mresp\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/requests/sessions.py\u001B[0m in \u001B[0;36msend\u001B[0;34m(self, request, **kwargs)\u001B[0m\n\u001B[1;32m    616\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    617\u001B[0m         \u001B[0;31m# Send the request\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 618\u001B[0;31m         \u001B[0mr\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0madapter\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0msend\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mrequest\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    619\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    620\u001B[0m         \u001B[0;31m# Total elapsed time of the request (approximately)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/requests/adapters.py\u001B[0m in \u001B[0;36msend\u001B[0;34m(self, request, stream, timeout, verify, cert, proxies)\u001B[0m\n\u001B[1;32m    438\u001B[0m                     \u001B[0mdecode_content\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0;32mFalse\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    439\u001B[0m                     \u001B[0mretries\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mmax_retries\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 440\u001B[0;31m                     \u001B[0mtimeout\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mtimeout\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    441\u001B[0m                 )\n\u001B[1;32m    442\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36murlopen\u001B[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001B[0m\n\u001B[1;32m    599\u001B[0m                                                   \u001B[0mtimeout\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mtimeout_obj\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    600\u001B[0m                                                   \u001B[0mbody\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mbody\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mheaders\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mheaders\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 601\u001B[0;31m                                                   chunked=chunked)\n\u001B[0m\u001B[1;32m    602\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    603\u001B[0m             \u001B[0;31m# If we're going to release the connection in ``finally:``, then\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36m_make_request\u001B[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001B[0m\n\u001B[1;32m    381\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mTypeError\u001B[0m\u001B[0;34m:\u001B[0m  \u001B[0;31m# Python 2.6 and older, Python 3\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    382\u001B[0m                 \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 383\u001B[0;31m                     \u001B[0mhttplib_response\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mconn\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mgetresponse\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    384\u001B[0m                 \u001B[0;32mexcept\u001B[0m \u001B[0mException\u001B[0m \u001B[0;32mas\u001B[0m \u001B[0me\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    385\u001B[0m                     \u001B[0;31m# Remove the TypeError from the exception chain in Python 3;\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/http/client.py\u001B[0m in \u001B[0;36mgetresponse\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m   1329\u001B[0m         \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1330\u001B[0m             \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m-> 1331\u001B[0;31m                 \u001B[0mresponse\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mbegin\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1332\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mConnectionError\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1333\u001B[0m                 \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mclose\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/http/client.py\u001B[0m in \u001B[0;36mbegin\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m    295\u001B[0m         \u001B[0;31m# read until we get a non-100 response\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    296\u001B[0m         \u001B[0;32mwhile\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 297\u001B[0;31m             \u001B[0mversion\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mstatus\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mreason\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_read_status\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    298\u001B[0m             \u001B[0;32mif\u001B[0m \u001B[0mstatus\u001B[0m \u001B[0;34m!=\u001B[0m \u001B[0mCONTINUE\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    299\u001B[0m                 \u001B[0;32mbreak\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/http/client.py\u001B[0m in \u001B[0;36m_read_status\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m    256\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    257\u001B[0m     \u001B[0;32mdef\u001B[0m \u001B[0m_read_status\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 258\u001B[0;31m         \u001B[0mline\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mstr\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mfp\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mreadline\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0m_MAXLINE\u001B[0m \u001B[0;34m+\u001B[0m \u001B[0;36m1\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m\"iso-8859-1\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    259\u001B[0m         \u001B[0;32mif\u001B[0m \u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mline\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;34m>\u001B[0m \u001B[0m_MAXLINE\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    260\u001B[0m             \u001B[0;32mraise\u001B[0m \u001B[0mLineTooLong\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m\"status line\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/anaconda3/lib/python3.6/socket.py\u001B[0m in \u001B[0;36mreadinto\u001B[0;34m(self, b)\u001B[0m\n\u001B[1;32m    584\u001B[0m         \u001B[0;32mwhile\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    585\u001B[0m             \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 586\u001B[0;31m                 \u001B[0;32mreturn\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_sock\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mrecv_into\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mb\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    587\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mtimeout\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    588\u001B[0m                 \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_timeout_occurred\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mKeyboardInterrupt\u001B[0m: "
     ]
    }
   ],
   "source": [
    "no_records = []    \n",
    "for index in range(len(data)):\n",
    "    if res_df.loc[index, 'Correct'] == True:\n",
    "        continue\n",
    "    \n",
    "    if 'boolean' in golden_answers[index]['answers']:\n",
    "        pass\n",
    "    elif golden_answers[index]['answers']['head']['vars'][0] in ['uri', 'count']:\n",
    "        var = golden_answers[index]['answers']['head']['vars'][0]\n",
    "        \n",
    "        g_answers = set()\n",
    "        m_answers = set()\n",
    "        \n",
    "        for i in golden_answers[index]['answers']['results']['bindings']:\n",
    "            g_answers.add(i[var]['value'])\n",
    "        \n",
    "        try:\n",
    "            for i in answers_model[index]['answers']['results']['bindings']:\n",
    "                m_answers.add(i[var]['value'])\n",
    "                \n",
    "            if g_answers - m_answers != set():     \n",
    "                print('\\n\\n', index)\n",
    "                print(len(golden_answers[index]['answers']['results']['bindings']))\n",
    "                print(golden_answers[index]['query']['sparql'])\n",
    "\n",
    "                print(len(answers_model[index]['answers']['results']['bindings']))\n",
    "                print(answers_model[index]['query']['sparql'])\n",
    "                print('\\n' * 5)\n",
    "        except:\n",
    "            print(index, 'NO RECORDS IT SEEMS', answers_model[index]['answers'])\n",
    "            \n",
    "            detected_entities, entities_list, unique_p = detect_entities(questions[index], index)\n",
    "            \n",
    "            detected_entities['r'] = list(detected_entities['r'].intersection(entities_list['r']))\n",
    "            detected_entities['p'] = list(detected_entities['p'].intersection(entities_list['p']))\n",
    "            detected_entities['c'] = list(detected_entities['c'].intersection(entities_list['c']))\n",
    "            \n",
    "            print(detected_entities)\n",
    "            \n",
    "            print(entities_list)\n",
    "            continue\n",
    "            \n",
    "            output, sparql_query = get_answer(detected_entities, y_true[index])\n",
    "            \n",
    "            if len(sparql_query) > 0:\n",
    "                sparql.setQuery(sparql_query)\n",
    "                sparql.setReturnFormat(JSON)    \n",
    "                result_set = sparql.query().convert()\n",
    "                                \n",
    "                print('found the right answer')\n",
    "                answers_model[index]['query']['sparql'] = sparql_query\n",
    "                answers_model[index]['answers'] = result_set     \n",
    "            else:\n",
    "                print(index, 'STILL NOT WORKING')\n",
    "            no_records.append(index)\n",
    "            break\n",
    "\n",
    "#     print(golden_answers[index]['answers'])\n",
    "#     print(golden_answers[index]['query']['sparql'])\n",
    "\n",
    "#     print('\\n\\n')\n",
    "    \n",
    "#     print(answers_model[index]['answers'])\n",
    "#     print(answers_model[index]['query']['sparql'])    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 408,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "31 NO RECORDS IT SEEMS []\n",
      "34 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 45\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> . ?x <http://dbpedia.org/ontology/species> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Species>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> . ?x <http://dbpedia.org/ontology/species> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Species> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 61\n",
      "5\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Levi_Lincoln,_Jr.> . ?x <http://dbpedia.org/property/successor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Governor>}\n",
      "2\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Levi_Lincoln,_Jr.> . ?x <http://dbpedia.org/property/children> ?uri . OPTIONAL { ?x rdf:type <http://dbpedia.org/ontology/Governor> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 72\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/Connecticut_Colony> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/Connecticut_Colony> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Place> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 99\n",
      "17\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oldsmobile_88> <http://dbpedia.org/property/related> ?x . ?x <http://dbpedia.org/ontology/predecessor> ?uri  . }\n",
      "18\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/related> <http://dbpedia.org/resource/Oldsmobile_88> . ?x <http://dbpedia.org/ontology/predecessor> ?uri . OPTIONAL { ?x rdf:type <http://dbpedia.org/ontology/Coach> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 100\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Arkansas> . ?x <http://dbpedia.org/ontology/city> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Arkansas> . ?x <http://dbpedia.org/ontology/mouthMountain> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/City> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "105 NO RECORDS IT SEEMS []\n",
      "181 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 200\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Ricky_Gervais> . ?uri <http://dbpedia.org/ontology/series> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?uri <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Ricky_Gervais> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/FictionalCharacter> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "222 NO RECORDS IT SEEMS []\n",
      "241 NO RECORDS IT SEEMS []\n",
      "260 NO RECORDS IT SEEMS []\n",
      "273 NO RECORDS IT SEEMS []\n",
      "286 NO RECORDS IT SEEMS []\n",
      "362 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 366\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Company> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 371\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE {?uri <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?uri <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Mammal> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "381 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 399\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2001_Speedway_Ekstraliga> <http://dbpedia.org/property/title> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2001_Speedway_Ekstraliga> <http://dbpedia.org/property/title> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "447 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 450\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award> . ?x <http://dbpedia.org/property/awards> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award> . ?x <http://dbpedia.org/property/awards> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Award> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 458\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> . ?x <http://dbpedia.org/property/producer> ?uri  . }\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> . ?x <http://dbpedia.org/property/music> ?uri }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "459 NO RECORDS IT SEEMS []\n",
      "495 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 508\n",
      "10\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sanggar_Agung> <http://dbpedia.org/property/architecturalStyle> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Sanggar_Agung> . ?uri <http://dbpedia.org/property/architecturalStyle> ?x . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Architect> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 511\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> . ?uri <http://dbpedia.org/property/language> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages> . ?x <http://dbpedia.org/ontology/languageFamily> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Writer> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "568 NO RECORDS IT SEEMS []\n",
      "588 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 600\n",
      "9\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld> . ?x <http://dbpedia.org/ontology/developer> ?uri  . }\n",
      "5\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld> . ?x <http://dbpedia.org/ontology/series> ?uri . OPTIONAL { ?x rdf:type <http://dbpedia.org/ontology/Engineer> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 607\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frontaccounting> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/GNOWSYS> <http://dbpedia.org/ontology/developer> ?uri}\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/GNOWSYS> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Software> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "681 NO RECORDS IT SEEMS []\n",
      "690 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 705\n",
      "2\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri }\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/river> <http://dbpedia.org/resource/Cohoes,_New_York> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/River> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "714 NO RECORDS IT SEEMS []\n",
      "765 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 783\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/John_Fanning_(businessman)> }\n",
      "0\n",
      "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Fanning_(businessman)> <http://dbpedia.org/ontology/developer> ?uri . }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "800 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 832\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE {?uri <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Swedish_language>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?uri <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Swedish_language> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Film> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 837\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Microsoft_Windows>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Microsoft_Windows> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Software> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 844\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/district> <http://dbpedia.org/resource/Blytheville_School_District> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/district> <http://dbpedia.org/resource/Blytheville_School_District> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/School> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "886 NO RECORDS IT SEEMS []\n",
      "\n",
      "\n",
      " 899\n",
      "1\n",
      "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/El_Sobrante,_California> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}\n",
      "2\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/El_Sobrante,_California> . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/TelevisionShow> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      " 903\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Indiana> . ?uri <http://dbpedia.org/ontology/child> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}\n",
      "1\n",
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Indiana> . ?x <http://dbpedia.org/ontology/child> ?uri . OPTIONAL { ?uri rdf:type <http://dbpedia.org/ontology/Person> } }\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "955 NO RECORDS IT SEEMS []\n"
     ]
    }
   ],
   "source": [
    "for index in range(len(data)):\n",
    "    if res_df.loc[index, 'Correct'] == False:\n",
    "        continue\n",
    "    \n",
    "    if 'boolean' in golden_answers[index]['answers']:\n",
    "        pass\n",
    "    elif golden_answers[index]['answers']['head']['vars'][0] in ['uri', 'count']:\n",
    "        var = golden_answers[index]['answers']['head']['vars'][0]\n",
    "        \n",
    "        g_answers = set()\n",
    "        m_answers = set()\n",
    "        \n",
    "        for i in golden_answers[index]['answers']['results']['bindings']:\n",
    "            g_answers.add(i[var]['value'])\n",
    "        \n",
    "        try:\n",
    "            for i in answers_model[index]['answers']['results']['bindings']:\n",
    "                m_answers.add(i[var]['value'])\n",
    "                \n",
    "            if g_answers - m_answers != set():     \n",
    "                print('\\n\\n', index)\n",
    "                print(len(golden_answers[index]['answers']['results']['bindings']))\n",
    "                print(golden_answers[index]['query']['sparql'])\n",
    "\n",
    "                print(len(answers_model[index]['answers']['results']['bindings']))\n",
    "                print(answers_model[index]['query']['sparql'])\n",
    "                print('\\n' * 5)\n",
    "        except:\n",
    "            print(index, 'NO RECORDS IT SEEMS', answers_model[index]['answers'])\n",
    "            no_records.append(index)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 409,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT (COUNT(?uri) as ?count) WHERE {?uri <http://dbpedia.org/property/training> <http://dbpedia.org/resource/San_Francisco_Art_Institute>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "101 105 106\n"
     ]
    }
   ],
   "source": [
    "index = 222\n",
    "print(golden_answers[index]['query']['sparql'])\n",
    "print('\\n' * 3)\n",
    "print(answers_model[index]['query']['sparql'])\n",
    "print(y_true[index], y_pred[index][0], y_pred[index][1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 412,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "detected_entities, entities_list, unique_p = detect_entities(questions[222], index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 414,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "({'c': {'http://dbpedia.org/ontology/Artist',\n",
       "   'http://dbpedia.org/ontology/Institution',\n",
       "   'http://dbpedia.org/ontology/Institutions',\n",
       "   'http://dbpedia.org/ontology/Number',\n",
       "   'http://dbpedia.org/ontology/Occupation',\n",
       "   'http://dbpedia.org/ontology/Place',\n",
       "   'http://dbpedia.org/ontology/Relative',\n",
       "   'http://dbpedia.org/ontology/Training',\n",
       "   'http://dbpedia.org/ontology/Work'},\n",
       "  'p': {'http://dbpedia.org/ontology/artist',\n",
       "   'http://dbpedia.org/ontology/institution',\n",
       "   'http://dbpedia.org/ontology/number',\n",
       "   'http://dbpedia.org/ontology/occupation',\n",
       "   'http://dbpedia.org/ontology/relative',\n",
       "   'http://dbpedia.org/ontology/training',\n",
       "   'http://dbpedia.org/property/artist',\n",
       "   'http://dbpedia.org/property/artists',\n",
       "   'http://dbpedia.org/property/institution',\n",
       "   'http://dbpedia.org/property/institutions',\n",
       "   'http://dbpedia.org/property/institutionss',\n",
       "   'http://dbpedia.org/property/number',\n",
       "   'http://dbpedia.org/property/numbers',\n",
       "   'http://dbpedia.org/property/occupation',\n",
       "   'http://dbpedia.org/property/occupations',\n",
       "   'http://dbpedia.org/property/relative',\n",
       "   'http://dbpedia.org/property/relatives',\n",
       "   'http://dbpedia.org/property/training',\n",
       "   'http://dbpedia.org/property/trainings'},\n",
       "  'r': {'http://dbpedia.org/resource/Count',\n",
       "   'http://dbpedia.org/resource/Interval_(music)',\n",
       "   'http://dbpedia.org/resource/Military_education_and_training',\n",
       "   'http://dbpedia.org/resource/San_Francisco_Art_Institute',\n",
       "   'http://dbpedia.org/resource/The_Who',\n",
       "   'http://dbpedia.org/resource/Visual_arts'}},\n",
       " {'c': {'http://dbpedia.org/ontology/Artist'},\n",
       "  'p': {'http://dbpedia.org/property/training'},\n",
       "  'r': {'http://dbpedia.org/resource/San_Francisco_Art_Institute'}})"
      ]
     },
     "execution_count": 414,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "detected_entities, entities_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 392,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(\"http://akswnc9.aksw.uni-leipzig.de/dbpedia/sparql\")\n",
    "index = 73\n",
    "# for index in range(len(data)):\n",
    "#     if answers_model[index]['query']['sparql'].startswith('SELECT ?uri'):\n",
    "#         answers_model[index]['query']['sparql'] = answers_model[index]['query']['sparql'].replace('SELECT ?uri', 'SELECT DISTINCT ?uri')\n",
    "# print(answers_model[index]['query']['sparql'])\n",
    "\n",
    "sparql.setQuery(answers_model[index]['query']['sparql'])\n",
    "sparql.setReturnFormat(JSON)    \n",
    "result_set = sparql.query().convert()\n",
    "\n",
    "answers_model[index]['answers'] = result_set\n",
    "print('\\n' * 5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}